[
  {
    "product":"710 LABS Live Rosin Badder 1g Dabbing Perfection Step into the world of premium concentrates with 710 LABS Live Rosin Badder. A perfect blend of innovation, quality, and authenticity. Elevate Your Dabbing with Unparalleled Quality\n\nWhy 710 LABS  Live Rosin Badder Stands Above\nAt 710 LABS, Theyre not just about creating products Theyre about crafting experiences that resonate with your lifestyle and aspirations. With the Live Rosin Badder is the epitome of 710labs dedication to authenticity, quality, and innovation. Made from meticulously selected cannabis strains and produced through a solventless process. Resulting in the essence of pure, potent, and unparalleled dabbing pleasure. With every dab, youre not just enjoying a premium product youre embracing a lifestyle of sophistication and perfection.\n\nAuthentic and Pure Experience the genuine essence of cannabis with a product thats as authentic as you are.\nInnovative Craftsmanship From selection to extraction, their process is a testament to our commitment to innovation and excellence.\nQuality Uncompromised Dive into a dabbing experience where quality isnt just a standard. its a passion.\n\nThe Essence of Sophistication and Authenticity\nThe 710LABS Rosin Badder is more than just a Concentrates. its a statement of your discerning taste and commitment to quality. By choosing 710 LABS, you align yourself with a brand that understands the importance of a premium, solventless experience that doesnt just satisfy but transcends expectations.\n   \nExperience Innovation in Every Dab\nWith 710 LABS Live Rosin Badder, youre not just partaking in a dabbing session youre embarking on a journey of discovery. A journey where innovation meets tradition, and quality meets authenticity. Its not just about the product its about the experience, the lifestyle.\nNeverland brings you the Best Concentrates in the world, Right here at Bangkok, Delivery anywhere in Thailand. Strain: N\/A, Strain: N\/A 4190"
  },
  {
    "product":"710 Labs Flowers  Garlic Cocktail 7  3.5g Experience the robust effects of 710 Labs Flowers with Garlic Cocktail 7, an indicadominant hybrid known for its strong garlic aroma.\nIdeal for stress relief and promoting sleep, this strain offers a balanced and relaxing high.\nPerfect for unwinding after a long day. ?? 710 Labs Flowers  Garlic Cocktail 7  3.5g ??\nExplore the unique and potent world of 710 Labs Flowers with Garlic Cocktail 7, a 3.5g container filled with premium cannabis buds.\nThis strain is known for its strong garlic aroma, complemented by earthy and spicy undertones.\nIts an indicadominant hybrid that offers a robust and relaxing experience, making it perfect for those seeking to unwind and relieve stress.\nThe 710 Labs name is synonymous with quality, ensuring you get toptier cannabis with every container. ?\nKey Features\n\nStrain Type Indicadominant hybrid, offering deep relaxation and calming effects.\nFlavor  Aroma A distinct garlic scent with hints of spice and earthiness, creating a unique and intriguing profile.\nPotency Known for its moderate to high THC content, delivering a strong and balanced high.\n\nBenefits\n\nStress Relief Garlic Cocktail 7 helps to calm the mind and body, ideal for relaxation after a long day.\nSleep Support This strains indica dominance promotes restful sleep, making it great for nighttime use.\nMood Enhancement Experience a gentle uplift in mood, providing a sense of calm and contentment.\n\nWhy Choose 710 Labs Flowers  Garlic Cocktail 7?\nIf youre seeking a unique and potent cannabis strain, Garlic Cocktail 7 is a top choice.\nIts distinct garlic aroma and indicadominant effects offer a soothing and relaxing experience.\nIdeal for those who enjoy a strong flavor profile and a calming high, this strain is perfect for unwinding and promoting restful sleep. ??\n\nDiscover the robust effects of 710 Labs Flowers with Garlic Cocktail 7 at Neverland Weed Shop.\nLet its unique aroma and relaxing high guide you to a state of tranquility and comfort.\nExperience the quality of 710 Labs with Garlic Cocktail 7 today! ?  2590"
  },
  {
    "product":"BIG CHIEF  Live Resin Disposable Experience the pinnacle of vaping with the Big Chief Live Resin Disposable Vape. Designed for discerning enthusiasts, this device encapsulates the essence of premium live resin in a convenient, disposable format. Whether youre a seasoned vaper or a curious newcomer, the Big Chief Disposable offers an unmatched experience.\nAvailable Flavors..\n\nChief OG  Hybrid\nSuper Lemon Haze  Sativa\nUzumaki  Hybrid\nTHC Bomb  Hybrid\nGuava  Sativa\n Why Choose Big Chief?\n\nTopQuality Resin Extracted from the finest cannabis, ensuring a pure and potent vape every time.\nReady to Use No charging or filling required, perfect for onthego lifestyles.\nDiscreet and Sleek Design Enjoy your session with subtlety and style.\n\nFeatures\n\nStrainSpecific Terpenes Each vape is infused with natural terpenes from select cannabis strains, enhancing flavor and effect.\nHigh Potency Delivers a robust and immediate experience, ideal for those seeking strong effects.\nZero Maintenance Fully disposable after use, with no need to clean or maintain.\n\nBenefits\n\nConvenience Effortlessly enjoy premium live resin without any preparation.\nPortability Slim and discreet, easily fits in your pocket or purse.\nVariety Available in multiple strains to suit all tastes and preferences.\n\nHow to Use Your Big Chief Disposable Vape\n\nRemove from Packaging Take out your Big Chief Vape from its secure packaging.\nInhale and Enjoy Simply draw from the mouthpiece to activate. No buttons, no hassle.\nDispose Responsibly Once depleted, dispose of the vape responsibly.\n\nPerfect For\n\nCannabis Connoisseurs Those who appreciate the finer details of cannabis terpenes and effects.\nOntheGo Vaping Ideal for users who need a quick, powerful hit without the fuss of recharging or refilling.\nDiscretion Users seeking a discreet way to enjoy cannabis.\n\nConclusion\nElevate your vaping experience with the Big Chief Live Resin Disposable Vape. Its not just a vape its a lifestyle choice for those who demand the best. Try Big Chief today and taste the difference quality makes.\n! elementor  v3.21.0  08052024 .elementorcolumn .elementorspacerinnerheightvarspacersize.econcontainerwidgetwidth100.econinner.elementorwidgetspacer,.econ.elementorwidgetspacerwidthvarcontainerwidgetwidth,varspacersizealignselfvarcontainerwidgetalignself,initialflexshrink0.econinner.elementorwidgetspacer.elementorwidgetcontainer,.econ.elementorwidgetspacer.elementorwidgetcontainerheight100width100.econinner.elementorwidgetspacer.elementorwidgetcontainer.elementorspacer,.econ.elementorwidgetspacer.elementorwidgetcontainer.elementorspacerheight100.econinner.elementorwidgetspacer.elementorwidgetcontainer.elementorspacer.elementorspacerinner,.econ.elementorwidgetspacer.elementorwidgetcontainer.elementorspacer.elementorspacerinnerheightvarcontainerwidgetheight,varspacersize.econinner.elementorwidgetspacer.elementorwidgetempty,.econ.elementorwidgetspacer.elementorwidgetemptypositionrelativeminheight22pxminwidth22px.econinner.elementorwidgetspacer.elementorwidgetempty .elementorwidgetemptyicon,.econ.elementorwidgetspacer.elementorwidgetempty .elementorwidgetemptyiconpositionabsolutetop0bottom0left0right0marginautopadding0width22pxheight22px Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A 2390"
  },
  {
    "product":"Baby Jeeter  Prerolled infused Experience premium cannabis with Baby Jeeter Prerolled infused joints.\nEach jar contains 5 perfectly crafted 0.5g joints, infused with liquid diamonds and dusted with kief for an unparalleled smoking experience. Baby Jeeter  Prerolled infused\nElevate your cannabis journey with Baby Jeeter Prerolled infused joints, now available at Neverland Weed Shop in Bangkok.\nThese meticulously crafted minijoints offer a powerful and flavorful experience in a convenient, pocketsized package.Each Baby Jeeter jar contains 5 handrolled 0.5g joints, totaling 2.5g of premium cannabis.\nWhat sets these prerolls apart is their infusion process  each joint is enhanced with potent liquid diamonds and dusted with kief, resulting in an average THC content exceeding 35.\nThis combination ensures a smooth, flavorful smoke with effects that are both fastacting and longlasting.\nAvailable Strains\n\nPina Colada Hybrid Tropical paradise in a joint, offering a perfect balance of relaxation and euphoria.\nGranddaddy Purp Indica A classic strain known for its deep relaxation and stressrelieving properties.\nStrawberry Shortcake Indica Sweet, berry flavors with a creamy exhale, perfect for unwinding.\nBlue Zkittlez Indica A fruity, candylike flavor profile with potent relaxing effects.\nHorchata Hybrid Creamy, cinnamonspiced notes with balanced hybrid effects.\nKiwi Kush Indica Tropical fruit flavors with a soothing, fullbody relaxation.\n\nKey Features\n\nPremium indoorgrown flower\nInfused with liquid diamonds for enhanced potency\nCoated in kief for extra flavor and effects\n5minute burn time per joint\nConvenient 5pack jar for easy storage and sharing\nHandrolled for consistent quality\nAverage THC content over 35\n\nWhy Choose Baby Jeeter Prerolled infused?\nBaby Jeeter offers a luxurious smoking experience in a compact form. Perfect for cannabis enthusiasts who appreciate quality, convenience, and potency.\nWhether youre looking to unwind after a long day, enhance your creative pursuits, or simply enjoy a premium smoke with friends, Baby Jeeter has a strain to suit your needs. Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A 420"
  },
  {
    "product":"Breakfast of Champions Strain  HYBRID Start your day right with the Breakfast of Champions strain, a perfectly balanced hybrid that offers an uplifting and relaxing experience.\nThis rare 5050 indicasativa blend combines the best of Fruity Pebbles and Animal Mints, delivering a sweet, fruity flavor with hints of mint and pine. Breakfast of Champions Strain  HYBRID\nElevate your mornings with the Breakfast of Champions strain, now available at Neverland Weed Shop in Bangkok.\nThis exceptional 5050 indicasativa hybrid is the perfect way to kickstart your day, offering a harmonious blend of relaxation and motivation.\nBred from the legendary Fruity Pebbles and Animal Mints strains, Breakfast of Champions boasts an impressive THC content that can reach up to 30, making it ideal for experienced users seeking a powerful yet balanced experience.\nKey Features\n\nGenetics Fruity Pebbles x Animal Mints\nType 50 Indica  50 Sativa Hybrid\nTHC Content Up to 30\nFlavor Profile Sweet fruity notes with hints of mint and pine\nAroma Sour berries, pine, and a touch of sharp mint\nEffects Uplifting, relaxing, and moodenhancing\n\nExperience\nThe Breakfast of Champions strain offers a unique journey that begins with a gentle cerebral lift, gradually spreading throughout your body.\nUsers report feeling happy, creative, and focused, with a subtle relaxation that doesnt hinder productivity.\nAs the high progresses, you may experience a mild case of the munchies, making it perfect for those who struggle with appetite in the morning.Potential \nBenefits\nThis strain is particularly favored by those dealing with\n\nChronic stress and anxiety\nFatigue\nDepression\nChronic pain\nLack of appetite\n\nAppearance\nBreakfast of Champions features dense, rounded buds with a dark olive green color, adorned with dark amber hairs and purple undertones.\nA thick coating of frosty white crystal trichomes gives these nugs an irresistible appeal.\nWhy Choose Breakfast of Champions?\nWhether youre looking to jumpstart your day, boost your creativity, or simply unwind in style, Breakfast of Champions offers a versatile and enjoyable experience.\nIts balanced effects and delightful flavor profile make it a favorite among cannabis enthusiasts of all levels.  450"
  },
  {
    "product":"Cold Fire Cartridge Experience the pinnacle of vaping with Clod Fire Cartridge.\nThese premium carts deliver unmatched flavor and potency, crafted from topshelf cannabis strains.\nPerfect for connoisseurs seeking a pure, additivefree experience. Clod Fire Cartridge are the epitome of quality and flavor in the vaping world.\nEach cartridge is meticulously filled with pure, potent distillate extracted from the finest cannabis strains, ensuring an unparalleled sensory experience.\n\nKey Features\n\nUnmatched Flavor and Potency Enjoy the truest flavors with our Cold Fire Juice, averaging 1020 terpenes.\nPure and Clean No distillate, no additives, no degradationjust pure, clean vapor.\nPremium Quality Extracted using a single process at below 100, preserving 100 of the natural flavor and potency.\nVersatile Options Available in various strains and collaborations, including Green Dragon and Seven Leaves.\n\nWhy Choose Clod Fire Cartridges?\n\nMichelin Star Rated Experience Our products offer a flavor experience akin to a Michelinstar meal.\nFor Connoisseurs by Connoisseurs Crafted with care in Los Angeles, CA, by a familyowned company dedicated to quality.\nExclusive Extracts Featuring both cured resin and live resin options, ensuring a rich and authentic flavor profile.\n\n\nElevate your vaping experience with Clod Fire Cartridges, available now at Neverland Weed Shop.\nPerfect for those who demand the best in flavor and potency. Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A 3090"
  },
  {
    "product":"Diip CBD Daily Oil 5 sachets 150mg Ingredients per 1 sachet\n\nCBD  30 mg\nMCT Oil  812 mg\nHemp Seed Oil  100 mg\nDAlphaTocopheryl Acetate  3 mg\n Diip CBD Daily Oil 5 sachets 150mg\nOur premium CBD oil is made from highquality hemp plants and contains pure, organic CBD extract.\nOur CBD oil is labtested to ensure purity and potency, and is free from harmful additives and contaminants.\nCBD oil has been shown to have a variety of potential health benefits, including reducing pain and inflammation, improving sleep quality, and reducing anxiety and depression.\nWe use only the best ingredients in our CBD oil, and our extraction process ensures that all the beneficial compounds in the hemp plant are preserved.\nOur CBD oil is also vegan, glutenfree, and nonGMO, making it a great choice for anyone looking for a natural, plantbased supplement.\n\n\nHow to Use\n\n\nTake 0.25 to 1 ml once or twice daily, as needed or desired.\nPlace the suggested serving size under the tongue and hold for 3060 seconds before swallowing.\nLonger wait times enhance absorption into the body.\nWe recommend determining the optimal serving size for yourself, as individual needs may vary.  300"
  },
  {
    "product":"Diip CBD Gummies 125mg Diip CBD Gummies 125mg\n\n\nCBD Morning Gummies 125 mg  Lychee flavor\n\n\nCBD Night Gummies 125 mg  Grape flavor\n\nCBD Immunity Gummies 125 mg  Apple flavor\n\nWarning The Product Names Sleep, Morning, Immunity and Daily are not an indication or claim to any function or intention to affect the structure of the body.\nThese statements have not been evaluated by the Food  Drug Administration.\nThis product is not intended to diagnose, treat, cure or prevent any disease. Individual results will vary. Diip CBD Gummies 125mg\n\nCBD Morning Gummies 125 mg  Lychee flavor\nCBD Morning Gummies are suitable for daytime use.\nThey contain extracts of CBD from hemp, which helps relieve stress, reduce anxiety, promote relaxation, and alleviate pain that may arise from work, exercise, or various activities during the day.\nAdditionally, they are enriched with natural extracts such as Goji Berry, known for invigorating the body and awakening the mind, providing a refreshing and clearheaded feeling. The Vitamin Premix B Complex included in the gummies contributes to nourishing the brain and nervous system, enhancing concentration, and promoting a fresh and clear mindset.\nIngredients per 1 piece\n\nCBD  25 mg\nVitamin B Complex  25 mg\nGoji Berry Extract  50 mg\nTaurine  70 mg\nAscorbic Acid  60 mg\nGammaAminobutyric Acid GABA  50 mg\nKorean Ginseng Extract  40 mg\nInositol  40 mg\nGreen Tea Extract  40 mg\n\nCBD Night Gummies 125 mg  Grape flavor\nCBD Sleep Gummies are suitable for use during the night or before bedtime.\nThey contain extracts of CBD from hemp, which helps relieve stress, reduce anxiety, promote relaxation, and alleviate pain that may arise from work, exercise, or various activities. Additionally, they are enriched with natural extracts such as LGlutamine, which aids in wound healing and stimulates the secretion of growth hormone, allowing the body to efficiently repair itself during sleep.\nChamomile Extract is also included to promote calmness and relaxation, reduce symptoms of anxiety, and aid in achieving a restful sleep.\nIngredients per 1 piece\n\nCBD  25 mg\nLGlutamine  40 mg\nChamomile Extract  30 mg\nVitamin Premix B Complex  25 mg\n\nCBD Immunity Gummies 125 mg  Apple flavor\nCBD Immunity Gummies are suitable for use at any time.\nThey contain extracts of CBD from hemp, which helps relieve stress, reduce anxiety, promote relaxation, and alleviate pain that may arise from work, exercise, or various activities.\nIngredients per 1 piece\n\nCBD  25 mg\nReishi Extract  200 mg\nZinc Gluconate  50 mg\nYeast BetaGlucan 85  150 mg\nAscorbic Acid Vitamin C  30 mg Flavors: N\/A, Flavors: N\/A, Flavors: N\/A 290"
  },
  {
    "product":"Diip CBD Night Capsule 750mg \nCBD isolate is known for its potential health benefits,\n\nincluding reducing pain and inflammation, promoting relaxation, and improving sleep quality.\nOur CBD is sourced from organic, nonGMO plants,\nand is free from harmful additives and contaminants. diip CBD night Capsule 750mg\n\n CBD isolate is known for its potential health benefits, including reducing pain and inflammation, promoting relaxation, and improving sleep quality. Our CBD is sourced from organic, nonGMO hemp plants, and is free from harmful additives and contaminants.\nInfomation\nLtheanine is an amino acid found in green tea that may help to reduce stress and promote relaxation.\nChamomile extract is a natural sleep aid that has been used for centuries to help calm the mind and promote restful sleep.\nGABA is a neurotransmitter that may help to reduce anxiety and promote relaxation.\nTart cherry extract is a natural source of melatonin, a hormone that regulates sleepwake cycles.\nLglutamine is an amino acid that may help to reduce inflammation and support healthy immune function.\nThe vitamins B1, 6  12 are essential for overall health and may help to support energy levels and cognitive function.\nOur CBD Capsules are vegan, glutenfree, and nonGMO, and are free from artificial colors, flavors, and preservatives.  1450"
  },
  {
    "product":"Diip CBD Oil 1,000mg Chamomile  Honey Flavor Diip CBD oil Camomile is a hempderived CBD oil with CBD isolate of 1,000 mg per bottle. For 1 full tube,\nit contains 33mg of CBD and 4 more active ingredients listed below.\nOur camomile  honey Diip, as soothing as it sounds,\nis thoughtfully made for you to end the days with calmness and to keep your healthy habits even easier. Before you call it a night,\nlets diip yourself for a restful moment and a fresh morning.\nBuy Weed  CBD Online At Neverland.OG  Weed Shop Thailand Diip CBD Oil 1,000mg Chamomile  Honey Flavor\nOur premium CBD oil is made from highquality hemp plants and contains pure organic CBD extract.\nOur CBD oil is labtested to ensure purity and potency and is free from harmful additives and contaminants.\nCBD oil has been shown to have a variety of potential health benefits\nIncluding reducing pain and inflammation, improving sleep quality and reducing anxiety and depression.\nDiip CBD use only the best ingredients in our CBD oil and our extraction process. ensures that all the beneficial compounds in the hemp plant are preserved.\nOur CBD oil is also vegan  glutenfree and nonGMO.\nMaking it a great choice for anyone looking for a natural plantbased supplement.\nAt Diip, we are committed to providing highquality Effective CBD products that promote health and wellness.\nWe stand behind our products and offer a satisfaction guarantee. Try our CBD oil today and experience the potential benefits for yourself!\nInside Natural Diip\nCBD isolate, MCT oil, Hemp seed oil, Vitamin E\nServing Guideline\n1 full tube  1 ml, 33 mg of CBD\n0.5 tube  0.5 ml, 16.5 mg of CBD\n0.3 tube  0.3 ml, 11 mg of CBD\n1 drop  1 mg of CBD\nBuy Weed  CBD Online At Neverland.OG  Weed Shop Bangkok, Thailand  1890"
  },
  {
    "product":"Diip CBD Oil 1,000mg Natural Flavor Our premium CBD oil is made from highquality hemp plants and contains pure, organic CBD extract.\nOur CBD oil is labtested to ensure purity and potency, and is free from harmful additives and contaminants.\nBuy CBD Online at Neverland.OG  Online Cannabis Shop!  Our premium CBD oil is made from highquality hemp plants and contains pure, organic CBD extract. Our CBD oil is labtested to ensure purity and potency, and is free from harmful additives and contaminants.\n CBD oil has been shown to have a variety of potential health benefits, including reducing pain and inflammation, improving sleep quality, and reducing anxiety and depression.\n We use only the best ingredients in our CBD oil, and our extraction process ensures that all the beneficial compounds in the hemp plant are preserved. Our CBD oil is also vegan, glutenfree, and nonGMO, making it a great choice for anyone looking for a natural, plantbased supplement.\n Inside Natural Diip\nCBD isolate, MCT oil, Hemp seed oil, Vitamin E\n Serving Guideline\n1 full tube  1 ml, 33 mg of CBD0.5 tube  0.5 ml, 16.5 mg of CBD0.3 tube  0.3 ml, 11 mg of CBD1 drop  1 mg of CBD  1890"
  },
  {
    "product":"Diip CBD Oil 300mg 10 Sachets Chamomile and Honey Flavor Net weight 10ml 1ml per sachet\nCBD 300mg 30mg per sachet\nIngredient CBD isolate, MCT oil, Seed oil, DAlphatocopheryl acetate\nChamomile  Honey Diip is CBD oil from CBD isolate.\nWe combine powerful ingredients with proven results to support the worlds most common, yet the most painful issues  Anxiety and Muscle tension. Diip CBD Oil Sachets 300mg Chamomile And Honey Flavor\n Our premium CBD oil is made from highquality hemp plants and contains pure, organic CBD extract. Our CBD oil is labtested to ensure purity and potency, and is free from harmful additives and contaminants.\n CBD oil has been shown to have a variety of potential health benefits, including reducing pain and inflammation, improving sleep quality, and reducing anxiety and depression.\n We use only the best ingredients in our CBD oil, and our extraction process ensures that all the beneficial compounds in the hemp plant are preserved.\nOur CBD oil is also vegan, glutenfree, and nonGMO, making it a great choice for anyone looking for a natural, plantbased supplement.\nInside Natural Diip\nCBD isolate, MCT oil, Hemp seed oil, Vitamin E, dalpha Tocopheryl acetate\nServing Guideline\n10 Sachets per Box\n1 Sachet  1 ml, 30 mg of CBD  890"
  },
  {
    "product":"Diip CBD Oil 300mg 10 Sachets Natural flavor Diip CBD oil 300mg has been shown to have a variety of potential benefits, improving your sleep quality, and reducing anxiety and depression. Buy Diip CBD oil at NEVERLAND.OG  Diip CBD Oil 300mg Natural flavor is made from highquality hemp plants and contains pure, Organic hemp extract.\nDiip CBD Oil has been shown to have a variety of potential benefits. Including reducing pain and inflammation, improving sleep quality and reducing anxiety and depression.  790"
  },
  {
    "product":"Flavorade Cartridge  Experience the ultimate in cannabis vaping with Flavorade Cartridges.\nThese premium carts deliver a potent and flavorful hit every time, ensuring a smooth and enjoyable experience. \nFlavorade Elevate your vaping experience with Flavorade Cartridge, crafted for those who seek quality and flavor in every puff.\nEach cartridge is filled with highquality cannabis oil, meticulously extracted to preserve the rich terpenes and cannabinoids that define the Flavorade experience.\nWhether youre a seasoned vaper or new to the scene, Flavorade Cartridge promise a consistent, potent and flavorful hit that will leave you satisfied.\nKey Features\n\nPremium Quality Made with toptier cannabis oil for a superior vaping experience.\nRich Flavor Each puff delivers a burst of flavor, thanks to the preserved terpenes.\nPotent Effects High THC content ensures a powerful and enjoyable experience.\nEasy to Use Compatible with most standard vape batteries for convenience. Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A 3050"
  },
  {
    "product":"Jolly Rancher THC Gummies 600mg Indulge in a nostalgic twist on a classic candy with Jolly Rancher THC Gummies 600mg.\nThese delectable gummies combine the mouthwatering flavors of Jolly Ranchers with the potent effects of THC, offering a delightful and powerful cannabis experience. Jolly Rancher THC Gummies 600mg\nExperience a blast from the past with a potent twist in Jolly Rancher THC Gummies 600mg.\nThese gummies perfectly capture the iconic flavors of the classic Jolly Rancher candies while delivering a powerful dose of THC for a truly unique cannabis experience.Each package contains a total of 600mg of THC, with each gummy offering a precise dose of 20mg.\nThis allows for easy and controlled dosing, making these gummies suitable for both novice and experienced cannabis users.\nHowever, due to the high potency, it is recommended to start with a low dose and wait for the effects to set in before consuming more.\nJolly Rancher THC Gummies come in a variety of mouthwatering flavors, including Green Apple, Watermelon, Grape, Blue Raspberry and Cherry.\nThese flavors are reminiscent of the original Jolly Rancher candies, providing a delightful and nostalgic taste that masks the earthy flavor of cannabis.\nKey Features\n\nPotency Each package contains 600mg of THC, with 20mg per gummy.\nFlavors Enjoy the classic Jolly Rancher flavors Green Apple, Watermelon, Grape, Blue Raspberry, and Cherry.\nNostalgic Twist Combines the beloved taste of Jolly Ranchers with the potent effects of THC.\nEasy Dosing Precise dosing of 20mg per gummy allows for controlled consumption.\nDiscreet Convenient and discreet way to enjoy the benefits of cannabis.\n\nWhy Choose Jolly Rancher THC Gummies?\nJolly Rancher THC Gummies offer a fun and nostalgic way to experience the effects of cannabis.\nThe combination of classic Jolly Rancher flavors and potent THC creates a unique and enjoyable experience.\nThese gummies are perfect for those seeking a discreet and convenient method of consuming cannabis while indulging in a delicious treat.  850"
  },
  {
    "product":"Lemon Cherry Gelato Strain  HYBRID Experience the perfect blend of sweet and sour with Lemon Cherry Gelato, a potent hybrid strain that offers a delightful mix of relaxation and euphoria.\nKnown for its mouthwatering flavor profile and balanced effects, this strain is a favorite among both novice and experienced cannabis enthusiasts. Lemon Cherry Gelato  HYBRID\nIndulge in the exquisite Lemon Cherry Gelato strain, now available at Neverland Weed Shop in Bangkok.\nThis hybrid masterpiece combines the best qualities of its parent strains  Sunset Sherbet, Girl Scout Cookies, and a mystery third strain possibly Lemon Haze  to create a truly unforgettable cannabis experience.\nKey Features\n\nType Hybrid 60 Indica  40 Sativa\nTHC Content 2025 on average\nFlavor Profile Sweet cherry and tart lemon, with hints of earthiness\nAroma Citrusy and fruity with subtle diesel undertones\nEffects Balanced relaxation and euphoria\n\nExperience\nLemon Cherry Gelato offers a wellrounded high that begins with a cerebral lift, gradually spreading throughout the body. Users report feeling happy, creative, and relaxed without being overwhelmed. As the high progresses, a gentle body buzz sets in, easing tension and promoting a sense of calm.\nPotential Benefits\nMany users choose Lemon Cherry Gelato to help manage\n\nStress and anxiety\nMild to moderate pain\nMood disorders\nInsomnia\nLack of appetite\n\nAppearance\nLemon Cherry Gelato buds are visually striking, featuring dense, olivegreen nugs adorned with vibrant orange hairs and a thick coating of frosty trichomes.\nThe colorful appearance hints at the strains potency and complex flavor profile.\nWhy Choose Lemon Cherry Gelato?\nWhether youre looking to unwind after a long day, boost your creativity, or simply enjoy a flavorful smoke, Lemon Cherry Gelato offers a versatile and enjoyable experience.\nIts balanced effects and delightful taste make it a top choice for cannabis connoisseurs and casual users alike.  450"
  },
  {
    "product":"Local Boys  Kratom Craft Soda Dope Lemon\nBoost your energy and mood with Local Boys Kratom Craft Soda in Dope Lemon flavor.\nInfused with highquality kratom, this lemon and honey soda is perfect for athletes and active individuals seeking a natural pickmeup.\nSundaze Cola\nEnjoy the classic flavors of root beer and vanilla with Local Boys Kratom Craft Soda in Sundaze Cola flavor.\nThis kratominfused soda provides a unique blend of energy and relaxation, ideal for professionals and creatives. Local Boys Kratom Craft Soda  Dope Lemon\nElevate your energy and mood with Local Boys Kratom Craft Soda in Dope Lemon flavor.\nInfused with highquality kratom, this refreshing soda combines the invigorating flavors of lemon and honey to provide a natural energy boost and mood enhancement.\nIdeal for athletes, active individuals, and those seeking a quick, natural pickmeup, Dope Lemon is your perfect companion for both invigorating mornings and relaxing evenings.\nKey Features\n\nEnergy Surge Quick, natural energy to tackle daily tasks.\nMood Improvement Brightens your day with a refreshing twist.\nEnhanced Endurance Keeps you motivated and moving.\nPerformance Boost Excellent for athletes and active individuals.\n\nLocal Boys Kratom Craft Soda  Sundaze Cola\nExperience the unique blend of energy and relaxation with Local Boys Kratom Craft Soda in Sundaze Cola flavor.\nThis artisanal soda combines the classic flavors of root beer and vanilla with the dualaction effects of kratom, providing a soothing yet invigorating beverage.\nPerfect for professionals, creatives, and anyone looking to replace alcoholic drinks with something more moodstabilizing and focusinducing.\nKey Features\n\nEnergy Boost Provides a natural lift for your active lifestyle.\nMood Elevation Enhances your mood for a more positive day.\nEndurance Support Helps you stay active and engaged longer.\nPerformance Enhancement Ideal for sustained focus and creativity. Flavor: N\/A, Flavor: N\/A 159"
  },
  {
    "product":"Local Boys  THC Craft Soda Discover Local Boys THC Craft Soda  a premium cannabisinfused beverage available in Mellow Berry and Grapefruit OG flavors.\nEnjoy a refreshing, hangoverfree alternative to alcohol with 1.6mg THC per 330ml bottle.\nExperience the perfect blend of flavor and relaxation. Experience the perfect blend of flavor and relaxation with Local Boys THC Craft Soda.\nThis innovative cannabisinfused beverage offers a delicious alternative to traditional consumption methods.\nCrafted with premium cannabis extracts and natural ingredients, each 330ml bottle contains 1.6mg THC, ensuring a consistent and enjoyable effect.\nLocal Boys THC Craft Soda is the ideal choice for those seeking a refreshing way to unwind without the hangover associated with alcohol.\n\nKey Features\n\nFDA approved and 100 legal\nLocally sourced and made\nNonaddictive\nEffects typically felt within 3060 minutes\nRecommended consumption 12 bottles per person\n\nElevate your relaxation routine with Local Boys THC Craft Soda  the perfect cannabisinfused refreshment for any occasion\n\nAvailable in two mouthwatering flavors\n\nMellow Berry A harmonious fusion of raspberry, strawberry, and cranberry, delivering a soothing and calming high.\nGrapefruit OG A zesty citrus delight that provides an uplifting and energizing experience. Flavor: N\/A, Flavor: N\/A 129"
  },
  {
    "product":"MELT AMF Exotic Liquid Diamonds 2g Experience a symphony of taste with MELT Exotic Liquid Diamonds disposables. Each carefully crafted strain offers a unique, mouthwatering flavor profile that tantalizes the senses. Elevate your vaping experience with premium, terpenepacked cannabis extracts that prioritize exceptional taste and aroma.\nAvailable Flavor..\n\nBlueberry Tart  Hybrid\nDewlato  Indica\nLemon Blast  Sativa\nPink Bubblegum  Hybrid\nWatermelon Lush  Hybrid\n Elevate Your Experience with Melt AMF Exotic Liquid Diamonds\nGet ready for an unparalleled cannabis experience with Melts Liquid Diamonds THCA Concentrate. Our expert extraction artists use only the finest, exotic cannabis strains to create this exceptional product. Melt AMF liquid diamonds offer the highest purity and potency.\nWhat are Melt THCA Diamonds?\nMelt THCA Diamonds are a premium cannabis concentrate that combines refined THCA crystals with a terpenerich sauce. This blend provides\n\nHigh THCA levels for unmatched potency\nRobust, strainspecific flavors\nInstant and powerful effects\nA fullspectrum cannabis experience\n\nWhy Choose Melt AMF Exotic Liquid Diamonds?\n\nNextlevel potency with up to 95 THC.\nTerpenerich live resin for incredible flavor.\n2 grams of premium extract in every pen.\nNo charging or filling  just inhale and go.\n7day riskfree satisfaction guarantee.\n\nElevate your vaping experience with Melt AMF Exotic Liquid Diamonds. Available exclusively at select retailers and delivery services. Get yours today and melt into pure cannabis bliss. Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A 2490"
  },
  {
    "product":"Melt THCA Diamonds LiveResin Disposable 2g The Melt THCA Diamonds LiveResin Disposable 2g offers a premium vaping experience, combining the potency of THCA diamonds with the rich, fullspectrum benefits of live resin!  \nSupreme Potency MELT THCA Diamonds Live Resin Disposable\n  The Melt THCA Diamonds LiveResin Disposable 2g is a toptier cannabis vape product that combines the unmatched potency of THCA diamonds with the rich, fullspectrum profile of live resin. This disposable vape pen is perfect for those who seek a powerful and flavorful experiences. \n   As you take your first draw, the rich, aromatic flavors envelop your senses, transporting you to a place of tranquility and inspiration. The potent blend of THCA diamonds and live resin delivers a powerful, clean high that melts away all the stresses. This is the magic of Melt, crafted with passion and precision, exclusively at Neverland Weed Shop, authorized distributor in Thailand.\nWhat Makes Melt THCA Diamonds Special?\n   Melt THCA Diamonds are renowned for their purity and potency, THCA diamonds is the purest form available. These crystalline structures are precisely extracted, ensuring maximum potency and purity. resulting in a product that is both powerful and clean. \n\nThe FullSpectrum Live Resin\n   Fullspectrum live resin is crafted from fresh, flashfrozen cannabis plants, preserving the full range of cannabinoids and terpenes. This method captures the essence of the plant, offering a more robust and flavorful experience compared to other extraction methods.\nThe Perfect Synergy\n   When you combine the potency of Melt THCA Diamonds with the rich, aromatic profile of fullspectrum live resin, you get a product that is truly exceptional. This blend offers a powerful, longlasting high.\n\n Why Choose Melt Diamonds LiveResin?\n\n\n\nSupreme Potency Combines the potency of Melt THCA diamonds  fullspectrum of live resin. \nFlavor Explosion Rich, aromatic flavors that dance on your palate with every draw, elevating your senses to new heights.\nReadytoUse Preloaded with 2000mg of premium THCA diamonds and liveresin, Thats ready to use anytime, anywhere.\nLab Tested Every strain passes all essential lab tests to ensure safety and potency.\nCostEffective Enjoy premium quality without the premium price, making Melt a costeffective choice in the Thai market.\n\n\n\n\n Usage Instructions\n\n\n\nUnpack Remove the Melt THCA Diamonds LiveResin Disposable 2g from its packaging.\nActivate Turn on the preheat switch and inhale to activate the device.\nEnjoy Take slow, steady draws to savor the rich flavors and potent effects.\n\n\n\n\n \n 7Days RiskFree Policy only at Neverland.og\n   MELT ensures your satisfaction with our 7day riskfree policy. Experience any malfunctions, leaks or damage on their part? Just send it back to Neverland.OG and Well replace it with a new one, no questions asked. Your trust and satisfaction are our top priorities.\n        \n Conclusion\n   The Melt AMF Diamonds LiveResin stands out for potency and rich flavor profile. And Thats why its a top choice for those seeking an intense vaping experience. By combining the intense effects of THCA diamonds with the fullspectrum benefits of live resin, this product offers a powerful and wellrounded high that is both enjoyable and effective. \n   Experience the best in cannabis vaping with Melt, Exclusive only at Neverland Weed Shop  THC Vape delivery in Thailand! Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 2490"
  },
  {
    "product":"Mimosa EVO Strain  Hybrid Indica Mimosa EVO is a highpotency hybrid strain with a 60 indica and 40 sativa ratio.\nKnown for its uplifting and euphoric effects, this strain boasts THC levels between 24 and 30.\nEnjoy its zesty tropical citrus flavor with hints of berries, perfect for both recreational and therapeutic use. Mimosa EVO Strain  hybrid Indica\nMimosa EVO, a highpotency hybrid from Barneys Farm, is an exceptional strain that combines the best of its parent strains, Orange Punch and Mimosa.\nWith a 60 indica and 40 sativa ratio, this strain delivers a balanced experience that is both uplifting and relaxing.\nMimosa EVO is known for its high THC content, ranging from 24 to 30, making it ideal for experienced users seeking a powerful and longlasting effect.\nKey Features\n\nHigh Potency THC levels between 24 and 30, suitable for experienced users.\nUnique Flavor Profile Zesty tropical citrus taste with hints of berries.\nBalanced Hybrid 60 indica and 40 sativa, offering both euphoric and relaxing effects.\nMedical Benefits Effective for treating anxiety, stress, migraines, and epilepsy.\nAppearance Dense, frosted buds with vibrant purple hues and a sticky resin coating.\n\nWhy Choose Mimosa EVO?\nMimosa EVO is perfect for those looking for a strain that offers both mental stimulation and physical relaxation.\nIts rich terpene profile, including limonene and myrcene, contributes to its luxurious, tangy aroma and flavor.\nWhether youre seeking an invigorating high or relief from medical conditions, Mimosa EVO is an excellent choice.\nUsage Tips\n\nBest enjoyed during the day or early evening due to its uplifting effects.\nStart with a small amount to gauge your tolerance, especially if youre new to highTHC strains.\nStore in a cool, dark place to maintain freshness and potency.  450"
  },
  {
    "product":"Mochi Strain  HYBRID Savor the sweet and creamy Mochi Strain, a balanced hybrid with a delightful flavor profile.\nEnjoy its relaxing yet energizing effects, perfect for staying calm and focused.\nIdeal for those seeking a harmonious cannabis experience without overwhelming drowsiness. ?? Mochi Strain ??\nWelcome to the delightful world of the Mochi Strain, a hybrid cannabis strain that combines the best of both indica and sativa genetics.\nThis strain is celebrated for its sweet, creamy flavor profile reminiscent of the popular Japanese dessert, mochi. With its balanced effects,\nMochi Strain is a perfect choice for those seeking relaxation without being overly sedated.\nWhether youre looking to unwind after a long day or enjoy a balanced high, Mochi Strain is the answer. ??\nKey Features\n\nStrain Type Hybrid, offering a blend of indica and sativa effects.\nFlavor  Aroma A sweet and creamy profile with hints of berry and mint, providing a unique and enjoyable taste.\nPotency Known for its moderate THC content, delivering a balanced high that doesnt overwhelm.\n\nBenefits\n\nRelaxation  Calmness Mochi Strains indica genetics provide a calming effect without causing excessive drowsiness.\nCreativity  Focus The sativa influence ensures you stay alert and focused, making it suitable for daytime use.\nMood Elevation Experience a gentle uplift in mood and a sense of happiness with this strains balanced effects.\n\nWhy Choose Mochi Strain?\n If youre seeking a cannabis strain that offers a harmonious blend of relaxation and energy, Mochi Strain is an excellent choice.\nIts sweet flavor profile and balanced effects make it a favorite among cannabis enthusiasts.\nWhether youre socializing with friends or unwinding at home, Mochi Strain provides a versatile experience thats both enjoyable and manageable. ??\n\nExperience the sweet and soothing effects of Mochi Strain at Neverland Weed Shop.\nLet its creamy flavor and balanced high transport you to a world of relaxation and creativity.\nDiscover why Mochi Strain is becoming a goto hybrid for cannabis lovers. ?  500"
  },
  {
    "product":"Muha Meds  Hash RosinDab  Neverland.OG Discover the unparalleled purity and potency with Muha Meds Hash Rosin, a premium concentrate for connoisseurs seeking the ultimate dabbing experience. Extracted using traditional methods to preserve the full spectrum of terpenes and cannabinoids, Muha Meds Hash Rosin represents the pinnacle of purity and potency in the cannabis market. Experience the Purity of Muha Meds Hash Rosin\nEmbrace the exceptional with Muha Meds Hash Rosin. Elevate your senses, experiences, and explore the purity of natures finest cannabis concentrate.\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Choose Muha Meds Hash Rosin?\n\nAuthentic Flavor Profile Retains the original flavor and aroma of the cannabis plant, providing an authentic experience.\nSolventless Extraction Crafted using a solventless technique that ensures a pure and clean product.\nPotent Effects Delivers strong, immediate effects for both recreational and medicinal users.\n\nKey Features\n\nHigh Terpene Content Experience the rich, fullbodied flavor profiles unique to each batch.\nPotency Guaranteed Each batch is tested to ensure high THC levels for maximum efficacy.\nVersatile Use Ideal for dabbing, vaping, and other methods, making it a versatile choice for all users.\n\nElevate Your Dabbing Experience with Muha Meds Dabs\nMuha Meds dabs, including our hash rosin, are renowned for their quality and potency. Youre not just purchasing a product youre investing in a dabbing experience that stands out from the rest. Whether youre a seasoned dabber or new to the scene, Muha Meds Hash Rosin is designed to elevate your experience to new heights.\n\nUnmatched Purity Free from additives, fillers, and solvents, our hash rosin is as pure as it gets.\nCraftsmanship Each batch is carefully crafted to ensure the highest quality and consistency.\nCommunity Trusted Join a community of enthusiasts who know and trust the Muha Meds name for their dabbing needs.\n\nVisit us at Neverland Weed Shop to discover more and become part of the Muha Meds family today. Strains: N\/A, Strains: N\/A 2390"
  },
  {
    "product":"Muha Meds Carts Premium THC Vape Cartridges in Thailand Explore Muha Meds Carts for a superior THC vaping experience. Known for their potency and flavor, these cartridges are a musthave for Thai vapers seeking quality and satisfaction. Elevate Your Vaping with Muha Meds Carts\nMuha Meds Carts are here to transform your vaping sessions. These THC vape cartridges blend quality, convenience, and style, making them a top pick in Thailand.\nExplore MuhaMed Cart for a superior THC vaping experience. Known for their potency and flavor, these cartridges are a musthave for Thai vapers seeking quality and satisfaction.\n\nWhy I Choose Muha Meds Carts?\n\nStrong and Pure Highgrade THC oil for a powerful vape.\nFlavorful Varieties A range of 10 strains, 10 delightful flavors!\nSleek and Discreet Designed for easy, stylish use.\nReliable Hits Consistent quality from start to finish.\n\n \nExperience Innovation with Muha Meds Cartridge\nMuha Meds isnt just about THC, Its about a superior vaping experience.\nAdvantages\n\nNo Leaks Enjoy a clean, hasslefree vape.\nFits Most Vapes Compatible with various devices.\nLab Tested Quality you can trust.\n\n \nYour Top Choice Muha Meds Vape Cartridge !\nChoosing MuhaMed Cart means opting for the Top brand from USA that values your vaping experience.\nTransform Your Vaping with MuhaMed Cart\nShop at Neverland Weed Shop for the best Muha Meds Carts in Thailand. Perfect for those seeking a blend of flavor and potency. Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 1790"
  },
  {
    "product":"Muha Meds Disposable 2G  Delivery in Thailand by Neverland Experience The Muha Meds Disposable 2g Authentic before anyone else in Thailand. This is a Top leading brand from the USA. So, This allinone vape pen is the ultimate solution for cannabis enthusiasts and travelers alike. So you can enjoy premium quality strains on the go.\n\n\n  Muha Meds Disposable 2G EditionsTHC Vape Pen\n   Experience The New Muha Meds 2g Disposable before anyone else in Thailand. From a top leading brand from the USA. So, This all in one vape pen is the ultimate solution for cannabis enthusiasts and travelers alike. So you can enjoy premium quality strains onthego. Learn more about cannabis vape, pods, disposable\n\nKey Features\n\nUnleash The World of Flavors\nChoose from a range of 10 delicious flavorsstrains  carefully crafted. So you can expect for a unique vaping experience. From energizing and uplifting sativas to soothing and relaxing indicas. The Muha Meds 2g Edition caters to every palate and mood.\n2 Grams of Pure THC\nLoaded with 2 grams of cannabis oil. As a result, This powerhouse THC vape provides a satisfying and longlasting experience that others simply cant match. Indulge in smooth and flavorful hits, delivering the perfect dose every single time.\nConvenience Meets Performance\nForget about refilling cartridges. This vape pen offers a convenient and hasslefree vaping experience. So you can focus on what really mattersthe unparalleled taste of our premium vape pen. The reliable performance of the vape pen ensures consistent enjoyment, hit after hit.\nGet the Best Value\nMuha Meds Disposable 2g vape pen is designed to provide longlasting, enjoyable vaping sessions. In addition to its excellent value. Their Vape Pen boasts a superior build quality that wont let you down.\nPerfect for THC Vapers, Travelers, and Smokers\nWhether youre a seasoned cannabis vaper or someone traveling in Thailand. The Disposable is the ultimate accessory for you. With its portable design, its easy to take with you everywhere you go, ensuring you always have a worldclass vaping experience within reach.\n\n                            \n   Discover the new unique design of the Muha Style, and elevate your vaping sessions to greater heights. You wont settle for anything less once youve tried this gamechanger in the cannabis vaping world. Try it today at Neverland.og  Cannabis store!\nCaution Now there are a lot of Fake Muha Meds products in Thailand. Read our How to spot fake MuhaMeds ? article for more info. Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 2650"
  },
  {
    "product":"NEW! STIIIZY Live Resin Liquid Diamond Pods Supreme Quality Step up your vape game with the exclusive STIIIZY Live Resin Liquid Diamond Pods.\nEach pod packs a punch of unparalleled flavor and potency, curated for those who desire nothing but the best. Available only at Neverland Weed Shop.     STIIIZY Live Resin Liquid Diamond Pods A New Era of Vaping Excellence\n   Immerse yourself to the FirstClass thc vaping experiences with STIIIZY Liquid Diamond Live Resin. A marvel of cannabis innovation, These premium 1g weed pods se\n\n\namlessly blend the formidable potency of liquid diamonds. Combine with the genuine, strainspecific essences preserved in live resin.\n  Crafted for purity and potency, enjoy the authentic flavors and maximum strength of exclusive liquid diamond technology. Prepare to transcend the ordinary and discover the of exquisite taste and premium quality with STIIIZY.\n  \n \nWhy Choose STIIIZYs Live Resin Liquid Diamond Pods?\nDesigned for those who accept nothing but the best. Savor the authentic flavors of each strain, with special live resin extraction method. These pods are delivering the original taste and setting new standards in cannabis vaping excellence..\nWhy STIIIZYs Pods Stand Out\n\nUnmatched Potency Experience the height of potency with liquid diamonds, offer intense effects and supreme satisfaction.\nAuthentic Flavor Enjoy the true essence of each strain, thanks to live resin extraction that preserves the original taste and aroma.\nPure Experience With no additives, fillers, or cutting agents. STIIIZY Pods promise a clean, unforgettable experience.\nDiverse Selection Choose from their carefully curated selection of 9 strains, each offering a unique profile of effects and flavors.\n\n\n\nConclusion\n   STIIIZY Live Resin LQD Pods are not just a step forward in THC vape technology They are a leap into the future of cannabis enjoyment. With Their dedication to quality, potency and flavor, these pods offer a sophisticated, satisfying vaping experience that remains unrivaled. Elevate your cannabis journey to unprecedented heights with STIIIZYwhere luxury meets purity in every pod!\n  Ready to transcend the ordinary? STIIIZYs Liquid Diamond Pods are exclusively available at Neverland.OG  Premium Cannabis Store with Online Delivery in Thailand!\ní Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 3300"
  },
  {
    "product":"Obama Runtz Strain  Hybrid Indica Experience the presidential power of the Obama Runtz Strain, a potent indicadominant hybrid that combines the best of Runtz and Obama Kush.\nKnown for its sweet, fruity aroma and relaxing effects, this strain is perfect for unwinding after a long day. Obama Runtz Strain  Hybrid Indica\nIndulge in the luxurious Obama Runtz Strain, an indicadominant hybrid that has taken the cannabis world by storm.\nThis strain is a cross between the famous Runtz and the highly soughtafter Obama Kush, resulting in a potent and flavorful flower thats fit for a president.\nKey Features\n\nAroma Sweet and fruity, with notes of berries and a hint of earthiness.\nEffects Relaxing and euphoric, perfect for unwinding and destressing. May induce a pleasant body high and a sense of calm.\nPotency Known for its high THC levels, ensuring a powerful and longlasting experience.\nAppearance Dense, colorful buds with shades of green, purple, and orange, covered in a thick layer of frosty trichomes.\nFlavor Tastes of sweet berries and tropical fruits, with a smooth and creamy smoke.\n\nWhy Choose Obama Runtz Strain?\nThe Obama Runtz Strain is ideal for those seeking a relaxing and enjoyable cannabis experience.\nIts potent effects and delightful flavor make it perfect for unwinding after a long day or enjoying a peaceful evening.\nWith its impressive lineage and unique characteristics, the Obama Runtz Strain is a musttry for any cannabis enthusiast.  450"
  },
  {
    "product":"Pink Runtz Strain  HYBRID Pink Runtz is a balanced hybrid strain with 2326 THC.\nKnown for its sweet, fruity flavor and uplifting effects, its perfect for social occasions and stress relief. Pink Runtz Strain  HYBRID\nPink Runtz is a balanced hybrid strain that has quickly gained popularity for its potent effects and unique flavor profile.\nThis strain is a phenotype of the renowned Runtz strain, created by crossing Pink Panties and Rainbow Sherbet.\nPink Runtz provides a strong and longlasting high that is perfect for both daytime and nighttime use.\nThe effects of Pink Runtz are predominantly uplifting and euphoric, making it an excellent choice for social occasions or creative projects.\nUsers often report a sense of happiness and relaxation, which can help alleviate symptoms of stress, anxiety and depression.\nMedicinally, Pink Runtz is popular for its ability to provide significant relief from chronic pain, nausea and other ailments.\nThe strains aroma is a delightful blend of sweet and fruity notes with a skunky undertone, courtesy of its rich terpene profile, which includes limonene, myrcene, and betacaryophyllene.\nThe flavor profile is equally enchanting, offering a sweet and fruity taste with berry and skunky hints that linger on the palate.\nKey Features\n\nType Balanced hybrid 50 indica  50 sativa\nTHC Content 2326\nAroma Sweet, fruity, skunky\nFlavor Fruity, sweet, berry, skunky\nEffects Euphoric, uplifting, relaxing\nMedical Uses Helps with stress, anxiety, depression, chronic pain, nausea  450"
  },
  {
    "product":"Polaroid Magic Mushrooms Gummies Polaroid Magic Mushrooms Gummies offer a fun and flavorful way to experience the benefits of psilocybin.\nEach pack contains 5g of premium psilocybin mushrooms and is available in five delicious flavors.\nPerfect for both new and experienced users seeking a convenient and enjoyable psychedelic experience. Polaroid Magic Mushrooms Gummies\nPolaroid Magic Mushrooms Gummies provide a delightful and convenient way to enjoy the benefits of psilocybin mushrooms.\nEach pack contains 5g of highquality psilocybin, expertly infused into delicious gummy candies.\nAvailable in five mouthwatering flavors, these gummies are perfect for both new and experienced users looking for a fun and easy way to consume psilocybin.\nKey Features\n\nHigh Potency Each pack contains 5g of premium psilocybin mushrooms.\nFlavor Variety Available in five delicious flavors\n\nStrawberry Trance\nMind Bender Berry\nTrippy Tangerine\nAcid Apple\nCosmic Citrus\n\n\nConvenient and Discreet Easy to carry and consume, perfect for onthego use.\nConsistent Dosage Each gummy is infused with a precise amount of psilocybin for a reliable experience.\nTherapeutic Benefits Combines the therapeutic effects of psilocybin with the pleasure of tasty gummies.\n\nWhy Choose Polaroid Magic Mushrooms Gummies?\nPolaroid Magic Mushrooms Gummies are ideal for those seeking a convenient, enjoyable, and therapeutic way to experience psilocybin.\nThe combination of premium psilocybin and delicious gummy flavors provides a balanced and pleasant journey.\nWhether youre looking to explore your mind or simply enjoy a tasty treat, Polaroid Magic Mushrooms Gummies are an excellent choice.\nUsage Tips\n\nStart with a small piece to gauge your tolerance, especially if youre new to psilocybin.\nConsume in a safe and comfortable environment.\nStore in a cool, dark place to maintain freshness and potency.\n\nOrder Now\nExperience the fun and flavorful Polaroid Magic Mushrooms Gummies at Neverland Weed Shop.\nAvailable now for online purchase or instore pickup in Bangkok.\nExplore our wide range of premium products and find the perfect treat for your needs. Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A 1750"
  },
  {
    "product":"Polaroid Supercolor Magic Mushrooms Chocolate Polaroid Supercolor Magic Mushrooms Chocolate offers a delightful blend of premium chocolate and psilocybin mushrooms.\nEach box contains 400mg of psilocybin and comes in six delicious flavors.\nPerfect for a unique and enjoyable experience. Polaroid Supercolor Magic Mushrooms Chocolate\nExperience the perfect fusion of indulgence and psychedelia with Polaroid Supercolor Psilocybin Mushrooms Chocolate.\nEach box contains 400mg of highquality psilocybin mushrooms, expertly blended with premium chocolate to provide a delightful and potent experience.\nAvailable in six mouthwatering flavors, this product is designed to cater to both your taste buds and your mind.\nKey Features\n\nHigh Potency Each box contains 400mg of psilocybin mushrooms.\nFlavor Variety Available in six delicious flavors\n\nDarkChoco Mocha Bean\nDarkChoco Fuel Diesel\nMilkChoco\nMilkChoco Hazelnut\nWhiteChoco with Cookies\nWhiteChoco with Strawberry\n\n\nPremium Ingredients Made with highquality chocolate and psilocybin mushrooms.\nUnique Experience Combines the therapeutic benefits of psilocybin with the pleasure of gourmet chocolate.\nConvenient Packaging Easy to carry and consume, perfect for both new and experienced users.\n\nWhy Choose Polaroid Supercolor Magic Mushrooms Chocolate?\nPolaroid Supercolor Psilocybin Mushrooms Chocolate is perfect for those seeking a unique, enjoyable, and therapeutic experience.\nThe combination of psilocybin mushrooms and premium chocolate provides a balanced and pleasant journey, whether youre looking to explore your mind or simply enjoy a delicious treat.\nWith six flavors to choose from, theres something for everyone.\nUsage Tips\n\nStart with a small piece to gauge your tolerance, especially if youre new to psilocybin.\nConsume in a safe and comfortable environment.\nStore in a cool, dark place to maintain freshness and potency.\n\nOrder Now\nExperience the unique blend of Polaroid Supercolor Psilocybin Mushrooms Chocolate at Neverland Weed Shop.\nAvailable now for online purchase or instore pickup in Bangkok.\nExplore our wide range of premium products and find the perfect treat for your needs. Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A, Flavor: N\/A 1850"
  },
  {
    "product":"Polkadot Magic Mushroom Chocolate  4g of Mushroom per box! Polkadot Magic Mushrooms Chocolate\n Package Contents Each box contains 4 grams of highquality magic mushrooms.\nExquisite Flavor Selection\n\n\n\nGood Luck Charms A whimsical blend of marshmallow and cereal bits for a nostalgic treat.\nButterlicious Creamy, rich butterinfused chocolate for a smooth and luxurious taste.\nCinnamon French Toast Spiced with cinnamon and a hint of sweetness, mimicking the beloved breakfast dish.\nCookies n Cream Classic and beloved, with crunchy cookie bits swirled in creamy white chocolate.\nHorchata Inspired by the traditional drink, with notes of cinnamon and vanilla in a comforting chocolate form.\nDark Intense For the purists, a deep, rich dark chocolate that satisfies the need for intensity.\nKrispy Chocolate Crunch A playful crunch meets smooth chocolate for a texturally dynamic bite.\nSMore A campfire favorite reimagined in chocolate, with hints of marshmallow and graham cracker.\n\n\n\nPremium Quality Ingredients Expertly dosed with psilocybin and crafted with the finest chocolates for a consistently delightful experience. Polkadot Magic Mushrooms Chocolate A Symphony of Flavors and Euphoria\n Elevate your senses with Polkadot Magic Mushrooms Chocolate, a luxurious and potent culinary delight designed for both the connoisseur and the curious.\nEach elegantly crafted box contains 4g of premium Magic Mushrooms, infused into a variety of exquisite chocolate flavors tailored to enchant any palate.\nKey Features\n\nBox Content Each box includes 4 grams of highquality magic mushrooms.\nVariety of Flavors Choose from an enticing selection including Original, Butterlicious, Pink Cheese Cake, Forbidden Fruit Loop, Horchata, Torone Delight, Krispy Chocolate Crunch, and SMore Fun.\nHighQuality Ingredients Made with premium chocolate and carefully dosed psilocybin, ensuring a delightful and consistent experience.\n\nBenefits\n\nEnhanced Creativity and Perception Experience a heightened sense of creativity and altered perception, perfect for exploring artistic endeavors or simply enjoying a more vivid perspective of the world.\nMood Elevation Known for their moodenhancing properties, these chocolates can help dissolve stress and bring about a joyful calm.\nConvenient and Discreet Packaged discreetly and designed for easy, controlled dosage, making them perfect for both beginners and experienced users.\n\nWhy Choose Polkadot Magic Mushrooms Chocolate?\n  Polkadot Magic Mushrooms Chocolate combines gourmet flavors with the transformative properties of psilocybin, offering a delicious and introspective escape.\n Whether youre unwinding after a long day or seeking a deeper connection with your creative side these chocolates provide a unique, controlled and enjoyable way to experience the benefits of magic mushrooms.\n \n Indulge in the rich, complex flavors and transformative effects of Polkadot Magic Mushrooms Chocolate at Neverland Weed Shop.com\nPerfect for those looking to explore the therapeutic and recreational benefits of psilocybin in a luxurious, tasty format. ? Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A 1750"
  },
  {
    "product":"Premium PreRolled 100 Cannabis bud, No mixed by NEVERLAND.OG Pre roll by NEVERLAND.OG\nGet your the fresh new roll with our Pre roll!\nYou can choose all strains that you want\n,You can high in 1 joint ,We added only pure cannabis bud no mixed.\nChoose your strains , and get high with Pre roll by NEVERLAND.OG Premium Pre Roll by NEVERLAND.OG\nWe made to order,You can choose any strains that you want.\nWe have many varieties of cannabis buds you can choose.\nWe make fresh new rolls for every order!\nWe use Organic slow burn Paper and Tips\nHave 2 size you can choose\n1 full gram , in 1 joint.\nHalf gram , In 1 joint  450"
  },
  {
    "product":"RAW Paper Classic Connoisseur  King size Rolling Paper 110mm with Tips RAW Paper Classic Connoisseur King size Rolling Paper 110mm with Tips contain a perfect blend of naturally unbleached plant fibers and are finished with an allnatural gum layer that matches the papers burn rate.\nRAW paper is made from natural plants with zero burning additives.\nProduct Details\n32 Leaves  Book\nLength 110 mm.\nFilter bottom  24 tips  Book Good quality rolling paper from RAW Paper Brand,Premium quality Cannabis product brand\nRAW Paper made from natural raw materials without fiber additives.\nMake the paper thin and light brown. The inside of the paper is stamped with a watermark in the form of a cross.\nThis is unique to the Raw brand, which helps to slow down the burning process.\nincrease the softness and softness So you can enjoy smoking even more.\nCome and buy RAW Paper Classic Connoisseurs King size Rolling Paper 110mm with Tips at NRVERLAND.OG Bkk Thailand, We have online delivery!  150"
  },
  {
    "product":"Raw Garden 510 Battery The Raw Garden 510 Battery is a highquality, variable voltage vape battery designed for use with 510 threaded cartridges.\nFeaturing a 350 mAh capacity and USB rechargeable design, this battery offers customizable vaping experiences with three temperature settings for optimal flavor. Raw Garden 510 Battery\nThe Raw Garden 510 Battery is the perfect companion for your vaping needs, offering a seamless and customizable experience.\nThis highperformance battery is designed for compatibility with all 510 threaded cartridges, allowing you to enjoy your favorite concentrates with ease.\nWith a 350 mAh capacity, this battery ensures longlasting performance, and its USB rechargeable design makes it convenient for onthego use.\nKey Features\n\n350 mAh Capacity Provides ample power for extended use.\nVariable Voltage Three temperature settings 2.9V, 3.1V, 3.3V for personalized flavor and intensity.\nInhale Activated Buttonless design for easy and intuitive use.\nUSB Rechargeable Comes with a USB adapter for convenient charging.\nCompact and Portable Easy to carry and fits discreetly in your pocket or bag.\n\nWhy Choose Raw Garden 510 Battery?\nThe Raw Garden 510 Battery is ideal for users seeking a reliable and versatile vaping solution.\nIts variable voltage feature allows you to adjust the temperature to your preference, enhancing the flavor and smoothness of your draw.\nWhether youre a seasoned vaper or new to the experience, this battery offers the perfect balance of performance and convenience.\nPerfect with Raw Garden Cartridge.\nUsage Tips\n\nTo turn the battery onoff, press the button five times in quick succession.\nAdjust the voltage setting by pressing the button to cycle through the LED indicators Blue 2.9V, Green 3.1V, Red 3.3V.\nInhale gently to activate the heating element and enjoy your vaping session.\nStore in a cool, dry place when not in use to maintain battery life.\n\nOrder Now\nEnhance your vaping experience with the Raw Garden 510 Battery, available now at Neverland Weed Shop.com\nOrder online or visit our store in Bangkok to explore our full range of premium vaping products.  1550"
  },
  {
    "product":"Raw Garden Cartridge Experience the best in cannabis vaping with Raw Garden Refined Live Resin Cartridges. Order now and elevate your vaping experience to new heights.\nAvailable Flavors..\n\nCreme OG\nBlueberry Cookies\n818 OG\nFrosted Sin\nSweet Fire OG\nPurple Unicorn\n Experience the Best with Raw Garden Cartridges\nRaw Garden  Refined Live Resin Cartridges are crafted for those who seek the highest quality in cannabis vaping. Our cartridges are made from singlesource live resin, ensuring a pure and potent experience every time.\nWhy Choose Raw Garden Live Resin?\n\n100 Cannabis Our cartridges contain no additives, fillers, or artificial flavors.\nHigh Potency Enjoy a powerful and consistent experience with every puff.\nClean Green Certified Sourced from our Clean Green Certified farm, ensuring the highest standards of cultivation and extraction.\n\nKey Features\n\nStrainSpecific Each cartridge is made from specific cannabis strains, providing unique flavors and effects.\nPure Flavor Experience the true taste of cannabis with our refined live resin.\nEasy to Use Compatible with most standard vape pens for convenience and ease of use.\n\nBenefits of Raw Garden Carts\n\nEnhanced Potency Our postextraction process removes nonpsychoactive compounds, maximizing the cartridges effectiveness.\nTrusted Quality Raw Garden is the most trusted and bestselling brand in cannabis, known for its rigorous testing and high standards.\nVersatile Use Perfect for any occasion, whether you want to relax, celebrate, or get active.\n\n\n \nHow to Use\n\nAttach Screw the Raw Garden cartridge onto your compatible vape pen.\nInhale Take a slow, steady puff to enjoy the rich flavors and potent effects.\nStore Keep your cartridge in a cool, dry place to maintain its quality.\nConvenient 510 Thread Works with most standard vape batteries.\n\nPerfect with Raw Garden 510 Battery Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A, Strain: N\/A 2450"
  },
  {
    "product":"SNOW BUD Diamond Infused Cannabis BudsUSA Experience the exceptional with SNOW BUD  Diamond Infused.\nA masterpiece from the Snow Bud, this hybrid marvel blends Zkittlez and Gelato into an aromatic symphony of sweet, candylike notes.\nWith an impressive THC content of 48.5, Crafted with a unique diamond infusion process, it elevates your senses with a perfect balance of uplifting joy and serene relaxation. Dive into a world where quality meets luxury in every puff. Unveiling the Magic of Diamond Infused Flowers\nExperience the exceptional with The SNOW BUD  Diamond Infused. A masterpiece from the USA, This hybrid marvel blends Zkittlez and Gelato into an aromatic symphony of sweet, candylike notes. With an impressive THC content of 48.5, Crafted with a unique diamond infusion process, it elevates your senses with a perfect balance of uplifting joy and serene relaxation. Dive into a world where quality meets luxury in every puff.\nWhat Makes SNOW BUD  Diamond Infused Special?\n\nPotency Unleashed Infusing THCA diamonds skyrockets the THC content to 48.5.\nSensory Delight Its sweet, candylike aroma promises a treat for your senses.\nPotent Effects Brace yourself for a powerful euphoria and deep relaxation, thanks to its high THC level of 48.5.\n\nThe Art of Diamond Infusion\nThe Snow Bud  Diamond Infused isnt just another strain its a masterpiece crafted with precision and care.\n\nPure Extraction We extract THCA crystals using advanced techniques, ensuring purity and potency.\nCrystallization These crystals, The diamonds, are formed under meticulous conditions.\nHeatActivated Transformation Heating turns THCA into THC, intensifying the psychoactive effects.\nFlavor Enhancement This process also enriches the strains already delightful flavor.\n\nConclusion\nSMp Diamond Infused, with its staggering 48.5 THC content, is more than just a cannabis strain its an experience, a celebration of the heights that cannabis craftsmanship can reach.\nDive into this luxurious journey transform your perception of what cannabis can be. \nRemember, with great potency comes the need for responsible enjoyment. At Neverland  Bangkok, Thailand! Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 660"
  },
  {
    "product":"STIIIZY 40s Mini Blunts Premium Prerolled Infused STIIIZY 40s Mini Blunts 0.5g Prerolled Infused  the ultimate choice for cannabis connoisseurs seeking convenience without compromising on quality.\n Each mini blunt is expertly crafted to deliver a potent and memorable experience.\n\nSize 0.5g prerolled, ideal for individual enjoyment or sharing.\nInfusion Enhanced with premium concentrates for maximum effect and flavor.\nConvenience Readytouse, perfect for onthego enjoyment or effortless relaxation.\n\n8 Strains Available\n\nStrawberry Coungh  Sativa\nPurple Punch  Indica\nStrawnana  Hybrid\nGelato  Hybrid\nBlue Dream  Sativa\nBiscotti  Indica\nPink Akai  Hybrid\nPineapple Express  Hybrid Sativa\n\n \nIdeal for onthego or relaxing moments, elevate your enjoyment with STIIIZY. STIIIZY 40s Mini Blunts  Premium PreRolled Infused\nExperience the ultimate in cannabis luxury with STIIIZY 40s Mini Blunts.\nEach mini blunt is meticulously prerolled with premium STIIIZY cannabis, infused with highquality live resin, and dusted with kief for an elevated smoking experience.\nDesigned for convenience and potency, these mini blunts deliver a consistent and powerful hit every time.\nKey Features\n\nPotent Effects Infused with live resin, each blunt offers a robust and longlasting high.\nRich Flavor Enjoy deep, fullbodied flavors that enhance your smoking experience.\n\n\nConsistent Quality Crafted with precision to ensure the highest quality in every puff.\nDiscreet and Portable Compact size makes it easy to carry and enjoy discreetly.\nNo Preparation Needed Readytosmoke, eliminating the need for grinding and rolling.\n\n \nBenefits\n\nVariety of Strains Available in multiple strains to suit all tastes and preferences.\nSmooth Inhale Designed for a smooth, enjoyable smoke without throat irritation.\nPremium Packaging Each blunt is packed in individual glass vials to maintain freshness and potency.\n\nHow to Use\n\nOpen Packaging Carefully open the sealed package to maintain freshness.\nLight and Inhale Light the blunt evenly and take slow, steady inhales to enjoy the full flavor and effects.\nDispose Responsibly After enjoying, dispose of the remnants responsibly.\n\nConclusion\nElevate your cannabis experience with STIIIZY 40s Mini Blunts.\nWhether youre at home or on the move, these blunts offer the ultimate in convenience and quality.\nOrder now and indulge in the excellence of STIIIZY infused blunts, prerolled for your immediate enjoyment. Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 420"
  },
  {
    "product":"STIIIZY Advance Battery Big Elevate your vaping experience with the STIIIZY Advanced Kit. This premium set includes the official BIIIG STIIIZY Battery, a USB charging cable, and a powerful 550mAh rechargeable battery with a USB port. Designed for those who demand more from their vaping experience. Get ready for bigger clouds and better flavor. Elevate your vaping experience with the STIIIZY Advanced Kit. This premium set includes the official BIIIG STIIIZY Battery, a USB charging cable, and a powerful 550mAh rechargeable battery with a USB port. Designed for those who demand more from their vaping experience. Get ready for bigger clouds and better flavor.  2500"
  },
  {
    "product":"STIIIZY Curated Live Resin 1g DabWax Experience the pinnacle of cannabis concentrates with STIIIZY Curated Live Resin.\nHarvested at peak freshness and flashfrozen to preserve the unique terpene profile of each strain, this premium live resin offers unmatched potency, flavor, and consistency.\nPerfect for dabbing enthusiasts seeking a pure and powerful experience.\n\n\n \nSTIIIZY Curated Live Resin\nElevate your cannabis experience with STIIIZY Curated Live Resin, a toptier concentrate crafted from premium cannabis harvested at the peak of its flavor and potency.\nThe flashfreezing process preserves the unique terpene profile of each strain, ensuring an unparalleled taste and aroma in every dab.\nWhether youre a seasoned dabber or exploring concentrates for the first time, STIIIZY Curated Live Resin delivers a potent, flavorful, and consistent experience.\nKey Features\n\nPremium Quality Made from the finest cannabis, harvested at peak freshness.\nFlashFrozen Preserves the unique terpene profile and potency of each strain.\nRich Flavor Offers an authentic and robust taste experience.\nHigh Potency Ideal for users seeking a powerful and effective concentrate.\nVersatile Use Perfect for dabbing and other concentrate consumption methods.\n\nWhy Choose STIIIZY Curated Live Resin?\nSTIIIZY is renowned for its commitment to quality and innovation in the cannabis industry.\nWith meticulous cultivation and precise extraction processes, STIIIZY ensures that each batch of Curated Live Resin meets the highest standards of purity and potency.\nEnjoy the pure essence of cannabis with a product that reflects STIIIZYs dedication to excellence.\nUsage Tips\n\nStart with a small dab to gauge your tolerance.\nUse highquality dabbing equipment for the best experience.\nStore in a cool, dark place to maintain freshness and potency.\n\nAvailable Strains\n\nTwisted Citrus  Sativa\nPink Champagne  Hybrid\nGrape ape  Indica\nPink Lemonade  Sativa\nPapaya Kush  Indica\nPurple Octane  Indica\nSTIIZY Rosay  Indica\n\nExplore a variety of strains, each offering a unique flavor and effect profile.\nWhether you prefer the uplifting effects of a sativa or the relaxing properties of an indica, STIIIZY Curated Live Resin has something for every preference. Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 1890"
  },
  {
    "product":"STIIIZY Live Rosin Badder  Dabs Perfection Discover the purest cannabis experience with STIIIZY Rosin Badder.\nSolventless extraction ensures maximum purity and potency.\nShop now at Neverland Weed Shop. Discover the Magic of STIIIZY Live Rosin Badder\n   Imagine a world where every dab is a journey into the heart of cannabis excellence. STIIIZY Live Rosin Badder is not just a product, its an experience crafted for those who seek the purity and potency. The solventless extraction process ensures that you get the most natural, flavorful, and powerful dabs possible. Welcome to the future of cannabis concentrates.\n \n  What Make STIIIZY Live Rosin Badder Standout ?\n\nSolventless Extraction for Maximum Purity STIIIZY Live Rosin is made using only ice, water, heat, and pressure, ensuring no chemicals are involved in the extraction process. This results in a product that is pure, potent, and rich in natural flavors.\nFull Spectrum of Cannabinoids and Terpenes By preserving the full spectrum of cannabinoids and terpenes, STIIIZY Rosin Badder offers a more holistic and effective cannabis experience. This synergy between cannabinoids and terpenes, known as the entourage effect, enhances the overall impact and benefits of the product.\nPotent and Flavorful With high THC levels and a rich terpene profile, STIIIZY Dab delivers a powerful and flavorful experience. Each dab provides a smooth, clean hit that is both potent and enjoyable.\n\n \n How to Use STIIIZY Dabs ?\n\nPrepare Your Dab Rig Ensure your dab rig is clean and ready for use.\nHeat The Banger Use a torch to heat the banger until it reaches the desired temperature.\nApply the Rosin Badder Use a dab tool to apply a small amount of STIIIZY Live Rosin to the heated quartz.\nInhale and Enjoy Inhale the vapor through the mouthpiece and enjoy the rich, flavorful and powerful experience.\n\n\n Why Choose STIIIZY Live Rosin ?\n    STIIIZY Live Rosin is the perfect choice for cannabis enthusiasts who value quality, purity, and potency. Our solventless extraction process ensures that you get the cleanest and most flavorful dabs possible. Whether youre an experienced dabber or new to concentrates, STIIIZY Dabs offers a superior cannabis experience that is second to none.\nMore Products from STIIIZY\n\nSTIIIZY 40 Mini Blunts PreRoll\nSTIIIZY LiveResin Liquid Diamonds Pods\n\n   Ready to elevate your cannabis dabbing experience? \nOrder your STIIIZY LiveRosin Badder today and discover the purest, most potent dabs available. \nVisit Neverland Weed Shop to shop now! Strains: N\/A, Strains: N\/A 2550"
  },
  {
    "product":"STIIIZY ORIGINAL THC Pods Now in Thailand  Pure, Potent, Perfect Experience the purity of concentrated THC with STIIIZYs original 1g pods. Crafted for excellence, These pods promise unmatched flavor and potency. Ideal for both beginners and pros in Thailand. STIIIZY  The Gold Standard in THC Vaping\nUnlock the potential of delightful vaping with STIIIZYs Original THC Pods. Each 1g pod is made from premium cannabis oil, designed to deliver an unforgettable experience!\n\nWhy STIIIZY Vape Pod Stands out ?\n\nPotent  Pure Each pod contains highly concentrated, solventfree THC oil that brings you the clean, pure vaping experience you deserve.\nStrains Variety Offering more than 20 strains of Sativa, Indica, and Hybrid strains tailored to fit any mood or setting.\nUnmatched Flavor Enjoy authentic, rich flavors that capture the essence of the original cannabis terpenes.\nSleek Design Their innovative pod design ensures a smooth vaping experience with a leakproof and burnfree system.\n\nCompatibility and Usage Guide\nCompatible with the Authentic STIIIZY battery for the best performance, STIIIZY Vape Pod are your goto choice for reliability and satisfaction.\n\nFeatures  Benefits \n\nHigh THC concentration for maximum effect.\nLabtested for quality and safety.\nInnovative Design Their pod system offeeers a leakfree, userfriendly vaping experience.\nSafety Assurance Free from harmful chemicals and additives.\n\n\n  How to Use STIIIZY Pods ?\nUsing This THC Pod is simple\n\nInsert the Pod into your STIIIZY Battery.\nInhale gently and enjoy the exclusive cannabis experience.\nEnjoy a smooth, flavorful vape experience.\n\n  \nExperience The Difference\nIndulge in the excellence of STIIIZYs premium THC pods, crafted to perfection in the USA and now available in Thailand. Each pod is a gateway to a unique experience, providing both flavor and potency with every puff.\nDiscover the difference with STIIIZY and take your vaping to the next level! Exclusively at Neverland Weed Shop Thailand! Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 2350"
  },
  {
    "product":"Stoner Patch THC Gummies 500mg Indulge in the delightful fusion of nostalgic candy flavors and potent THC with Stoner Patch THC Gummies 500mg.\nAvailable in a variety of mouthwatering flavors including Original, Strawberry, Grape, Watermelon, and Tropical, these gummies offer a discreet and enjoyable way to experience the benefits of cannabis. Stoner Patch THC Gummies 500mg\nExperience the perfect blend of childhood nostalgia and adult indulgence with Stoner Patch THC Gummies 500mg.\nThese carefully crafted gummies combine the classic flavors of your favorite candies with the potent effects of THC, offering a unique and enjoyable cannabis experience.\nEach pack contains a total of 500mg of THC, with each gummy delivering a precise dose of 100mg.\nThis allows for easy and controlled dosing, catering to both novice and experienced cannabis users.\nHowever, due to the high potency, it is recommended to start with a low dose 14 to 12 of a gummy and wait for the effects to set in before consuming more.\nStoner Patch THC Gummies come in a variety of enticing flavors, each reminiscent of the classic candies you know and love.\nAvailable Flavors\n\nOriginal The classic Stoner Patch flavor that started it all.\nStrawberry A sweet and juicy strawberry flavor that tantalizes your taste buds.\nGrape A bold and refreshing grape flavor thats sure to satisfy.\nWatermelon A crisp and refreshing watermelon flavor thats perfect for summer.\nTropical A delightful blend of exotic tropical fruits that transport you to paradise.\n\nThese flavors effectively mask the earthy taste of cannabis, making the experience more enjoyable for those who may not appreciate the natural flavor of THC.\nKey Features\n\nPotency Each pack contains 500mg of THC, with each gummy delivering 100mg.\nFlavors Choose from Original, Strawberry, Grape, Watermelon, and Tropical.\nNostalgic Taste Combines the beloved flavors of classic candies with the effects of THC.\nPrecise Dosing Each gummy contains 100mg of THC, allowing for controlled consumption.\nDiscreet and Convenient Enjoy the benefits of cannabis without drawing attention.\n\nWhy Choose Stoner Patch THC Gummies?\nStoner Patch THC Gummies offer a fun and discreet way to enjoy the effects of cannabis.\nWith a variety of delicious flavors and precise dosing, these gummies cater to a wide range of preferences and needs.\nWhether youre looking to unwind after a long day, manage pain, or simply enjoy a tasty treat, Stoner Patch THC Gummies provide a convenient and enjoyable solution. Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A 750"
  },
  {
    "product":"Strawberry Amnesia Strain  Sativa Strawberry Amnesia is a sativadominant hybrid with 2225 THC.\nRenowned for its sweet strawberry flavor and uplifting effects, its ideal for daytime use and stress relief. Strawberry Amnesia Strain  Sativa\nStrawberry Amnesia is a sativadominant hybrid strain that offers a unique blend of invigorating effects and delightful flavors.\nBred from the renowned Strawberry Cough and Amnesia strains, Strawberry Amnesia is celebrated for its ability to uplift and energize. \nThe effects of Strawberry Amnesia are predominantly uplifting and euphoric, making it an excellent choice for those looking to boost their mood and creativity. \nUsers often report increased focus and motivation, making it ideal for social gatherings or creative projects.\n Medicinally, Strawberry Amnesia is popular for its ability to alleviate stress, depression, and anxiety, providing a calming yet energizing experience.\nThe strains aroma is a delightful blend of sweet strawberries and earthy undertones, courtesy of its rich terpene profile, which includes myrcene, pinene, and caryophyllene.\n The flavor profile is equally enchanting, offering a sweet and fruity taste with herbal notes that linger on the palate.\nKey Features\n\nType Sativadominant hybrid\nAroma Sweet strawberry, earthy\nFlavor Sweet, fruity, herbal\nEffects Energetic, euphoric, uplifting\nMedical Uses Helps with stress, depression, anxiety  450"
  },
  {
    "product":"Strawberry Jello Runtz Strain  Hybrid Indica Indulge in the sweet and fruity delight of the Strawberry Jello Runtz Strain, a hybrid cannabis flower that combines the best of Strawberry Jello and Runtz.\nKnown for its mouthwatering aroma and balanced effects, this strain offers a unique and enjoyable experience. Strawberry Jello Runtz Strain  Hybrid Indica\nPrepare your taste buds for a treat with the Strawberry Jello Runtz Strain, a hybrid cannabis flower thats as delightful as it sounds.\nThis strain is a cross between the flavorful Strawberry Jello and the popular Runtz, resulting in a unique and mouthwatering flower thats perfect for any occasion.\nKey Features\n\nAroma Sweet and fruity, with a strong strawberry scent reminiscent of strawberry jello.\nEffects Balanced and uplifting, offering a blend of relaxation and creativity. May induce a sense of happiness and euphoria.\nPotency Known for its moderate to high THC levels, ensuring a satisfying and enjoyable experience.\nAppearance Colorful buds with shades of green and purple, covered in a layer of frosty trichomes and orange hairs.\nFlavor Tastes of sweet strawberries and creamy jello, with a smooth and pleasant smoke.\n\nWhy Choose Strawberry Jello Runtz Strain?\nThe Strawberry Jello Runtz Strain is perfect for those seeking a flavorful and balanced cannabis experience.\nIts unique aroma and taste make it a favorite among cannabis enthusiasts, while its effects offer a versatile experience suitable for both relaxation and creativity.\nWhether youre looking to unwind or spark your imagination, the Strawberry Jello Runtz Strain is a musttry.  450"
  },
  {
    "product":"TRE HOUSE  Live Resin HHC Vape Pen TRE HOUSEs Live Resin HHC Vape Pen offers 2g of highly potent HHC for a truly unforgettable experience\nwith a rechargeable and disposable design for maximum convenience. TRE HOUSE  Live Resin HHC Vape Pen\nExperience the Power of Live Resin HHC with TRE HOUSE\nUnleash the full potential of HHC with TRE HOUSEs Live Resin HHC Vape Pen, a gamechanger in the world of cannabis vaping.\nThis revolutionary pen is packed with 2 grams of highly potent Live Resin HHC, ensuring a truly unforgettable experience.\nKey Features\n\n2g of Highly Potent Live Resin HHC Unparalleled potency for an unmatched high.\nRechargeable for Maximum Enjoyment Get the most out of your pen with approximately 800 puffs.\nDisposable and Convenient No hassle, no mess  just pure, unadulterated bliss.\nZero Additives Pure HHC for a genuine experience.\nPrepare for Liftoff A truly psychotropic effect that will leave you wanting more.\n\nPerfect for You If\n\nYoure seeking a powerful, convenient, and discreet way to enjoy HHC.\nYou love the taste of Sour Diesel and want to experience it in a whole new way.\nYoure looking for a premium vaping experience that will leave you feeling elevated and inspired. Strain: N\/A 2290"
  },
  {
    "product":"TRE HOUSE  THC Delta9 Gummies with CBD 11 400mg TRE HOUSE  THC Delta9 Gummies with CBD 11 400mg\n\n20mg fullspectrum CBD per serving\nTastes like a combination of fresh peaches  pears\nCan get you super baked\nVegan  glutenfree\n1 gummy per serving\n20 or 40 gummies per bottle\nWarning May cause psychotropic effect\n TRE HOUSE  THC Delta9 Gummies with CBD 11 400mg\n Indulge in the delightful and balanced experience of TRE HOUSE  Delta 9 Gummies with CBD 11 400mg, your new goto for harmonized relaxation and wellness.\nEach gummy packs 20mg of Delta 9 THC and CBD, perfectly balanced in a 11 ratio to ensure a smooth, enjoyable experience with every bite.\nInfused with real peach and pear fruit juices, these gummies not only taste delicious but also offer the benefits of fullspectrum cannabinoids.\nThe vegan and glutenfree formulation makes them accessible for all dietary preferences, ensuring that everyone can enjoy the calming and therapeutic effects. ??\nKey Features\n\nPotency and Quantity Each bottle contains 20 gummies, with each gummy delivering 20mg of both Delta 9 THC and CBD.\nFlavor Delicious Peach Pear flavor made from real fruit juice for a natural and refreshing taste.\nQuality Vegan and glutenfree, crafted to meet dietary needs without compromising on quality or effectiveness.\n\nBenefits\n\nBalanced Effects The 11 ratio of Delta 9 THC to CBD offers a balanced and mild psychoactive experience, coupled with the calming benefits of CBD.\nStress Relief Ideal for reducing stress and anxiety, promoting a sense of calm and wellbeing.\nEnhanced Mood Enjoy the moodenhancing properties of THC while the CBD helps keep the experience smooth and grounded.\n\nWhy Choose TRE HOUSE  Delta 9 Gummies with CBD 11 400mg?\nTRE HOUSE gummies are perfect for those looking to integrate a controlled and enjoyable cannabis experience into their wellness routine.\nThe natural fruit flavors and highquality ingredients provide a premium edible thats both effective and delightful to consume.\nWhether youre unwinding after a long day or seeking a gentle mood lift, these gummies deliver relaxation and satisfaction. ??\n\nDiscover the unique blend of Delta 9 THC and CBD in TRE HOUSE gummies at Neverland Weed Shop.\nSavor the taste of real fruit juice and experience the balanced effects that these gummies offer.\nDive into a world of relaxation and flavor with every gummy! ??  1350"
  },
  {
    "product":"TRE HOUSE  THCA Live Resin Liquid Budder Vape Pen Unlock the Power of THCA with TRE HOUSE Discover the ultimate vaping experience with TRE HOUSEs THCA Live Resin Liquid Budder Vape Pen TRE HOUSE  THCA Live Resin Liquid Budder Vape Pen\nExperience the Ultimate THCA Vape Pen\n\nUnlock the Power of THCA with TRE HOUSE Discover the ultimate vaping experience with TRE HOUSEs THCA Live Resin Liquid Budder Vape Pen.\nThis 2gram, rechargeable vape pen combines the potency of THCA with the rich flavors of live resin and liquid budder, ensuring a truly unforgettable experience.\nWhite Widow Hybrid THCA Live Resin Liquid Budder Vape Pen\n\n2g of Highly Potent Live Resin Liquid Budder\nTastes Like the Classic White Widow Strain\nRechargeable for Maximum Enjoyment Approx. 800 Puffs!\nDisposable\nZERO Additives\nGet Ready to Blast Off\n\nSunset Sherbet Indica THCA Live Resin Liquid Budder Vape Pen\n\n2g of Highly Potent Live Resin Liquid Budder\nTastes Like the Classic Sunset Sherbet Strain\nRechargeable for Maximum Enjoyment Approx. 800 Puffs!\nDisposable\nZERO Additives\nGet Ready to Blast Off\n\nBenefits\n\nRelaxation\nMood Elevation\nBody Buzz\nHead Buzz\nMildly Trippy\nMunchies\n\nDirections for Best Results\n\nTake a Light Puff for Beginners\nRechargeable with MicroUSB Charger\n\nWhat Is THCA?\n\nThe Chemical Precursor to THC\nOffers Therapeutic, NonPsychoactive Benefits in Raw Form\nConverts to THC When Heated\n\nWhat Is Live Resin?\n\nExtra Potent, Flavorful Cannabis Concentrate\nRetains Complete Cannabinoid, Terpene, and Flavonoid Profiles\n\nWhat Is Liquid Budder?\n\nThick, Peanut Butter Texture Cannabis Concentrate\nUsually Melted on Dab Rigs or Layered on Bud Strain: N\/A, Strain: N\/A 2450"
  },
  {
    "product":"TRE HOUSE Magic Mushroom Vape 2g Get ready to soar with TRE HOUSE Magic Mushrooms Vape!\nThis super convenient vape bursts into action right out of the box with 2g of our finest magic mushroom blend.\nExpect around 800 vibrant puffs of delicious pink lemonade flavor, perfect for anyone in Thailand looking to spice up their routine with some psychedelic fun. Just unpack, puff, and let the magic take over! Get Ready for Adventure with TRE HOUSE Magic Mushroom Vape!\nUnlock the doors to an exhilarating psychedelic experience with TRE HOUSEs Magic Mushroom Vape! Its your perfect partner for microdosing, bringing you all the fun and introspection without the hassle. Just open, puff, and sail into a sea of bliss!\nWhy Youll Love Our Magic Mushroom Vape\n\nPop and Go! Your adventure starts the moment you unwrap the penno waiting, no fuss!\nPerfectly Balanced Ideal for a smooth and controlled experience, making your microdosing journey just right.\nTastes Like Joy! Every inhale is a burst of pink lemonade, cooling and delightful!\n\nPacked with Goodness!\n\n2g of Pure Magic Our special blend ensures a consistent, joyful ride.\nOnly the Best Ingredients We use allnatural ingredients for a clean and safe experience.\nLoads of Fun With about 800 puffs per pen, the good times keep coming!\n\nTips for an Awesome Experience\nStart with a light puff, feel the vibe, and find your perfect groove. Remember, its powerfulso let the good times roll at your own pace!\nAre you ready to turn up the fun? TRE HOUSE Magic Mushroom Vape is here to take your microdosing to the next level! With its delightful flavor and easy use, its the perfect way to introduce a little extra magic into your day. Dont waitgrab yours and start the party! Flavor: N\/A, Flavor: N\/A 3500"
  },
  {
    "product":"Vessel Core The Premium 510 Battery  Neverland.OG Discover Vessel Core Designed for excellence, the Vessel Core combines elegant aesthetics with robust performance, ensuring an unmatched vaping experience. Experience the Elite Vessel Core 510 Battery\nThe Vessel Core is not just any 510 battery its a statement of style and efficiency, proudly offered by the renowned Vessel Brand. This product embodies the perfect blend of elegance and performance, making it an essential accessory for vape enthusiasts in Thailand.\n\n\nFeatures a wide 510 crown to accommodate cartridges of all diameters\nPowered by a highquality 260mAh lithiumion rechargeable battery core\n3LEDs indicate battery life and power settings\nFour 4 powervoltage settings 2.4V, 2.8V, 3.2V, 3.6V\nUSBC charging port  cable\nCompatible with Rover Cases\nDimensions 3.3L x 0.55D\nWeight 23g\n\nTrust and Quality with Vessel Thailand\nVessel Brand is synonymous with quality and reliability. Choosing Vessel Core means opting for a product that is revered by vaping connoisseurs in Thailand and worldwide. With its robust build and superior performance, the Vessel Core stands out as the preferred choice for those who appreciate quality.\nPerfect Match for Your Favorite Cartridges\nThe Vessel Core 510 battery is designed to be universally compatible with most cartridges. t Its versatility means you can enjoy a wide range of vaping experiences without the need for multiple devices.\n \n\nJoin the Community of Satisfied Vapers in Thailand\nJoin a growing community of satisfied customers who have chosen the Vessel Core for its unmatched performance and elegant design. Experience the difference with Vessel Thailand  where quality meets innovation.\n \nGet Your Vessel Core 510 Battery Today\nElevate your vaping experience with the Vessel Core, available now in Thailand. Trust the Vessel Brand for a premium, consistent, and stylish vaping journey. Visit Neverland Weed Shop to secure your Vessel Core 510 battery and step into a world of refined vaping. Core: N\/A, Core: N\/A, Core: N\/A, Core: N\/A 2550"
  },
  {
    "product":"WEEDY WEED POD  Disposable THC Vape Pod Discover the ultimate vaping convenience with the Weedy Vape and our exclusive Weedy Weed Pod.\nThis compact, disposable device is prefilled with a topnotch THC vape oil, boasting 10 exquisite fruity cannabis strains to choose from.\nIts USBpowered for consistent performance and designed for onthego ease. Elevate your vaping experience with Weedy Vape, where fruity flavors meet cannabis bliss in every puff! Introducing the Weedy Weed Pod, your goto solution for experiencing the delightful fusion of fruity and cannabis flavors onthego.\n Our Weedy Weed Pods is specifically designed to offer a seamless and hasslefree vaping experience. Ensuring you can enjoy your favorite strains anytime, anywhere.\nWeedy Vape product features a userfriendly disposable vape design. prefilled with premiumquality THC vape pen disposable vape oil. Ensuring maximum convenience without any compromise on flavor or potency.\n The Weedy Weed Pods are available in an assortment of 10 mouthwatering fruity cannabis strains.\n Each crafted to perfection to deliver an unparalleled taste experience Powered by a reliable USB and rechargeable battery. The Weedy Vape guarantees a consistent and satisfying vaping journey from start to finish. \n With its compact and portable design, you can easily carry it in your pocket or bag. Ensuring your favorite flavors are always within reach.\nEnhance your vaping experience with the Weedy Weed Pod and Weedy Vape where convenience meets quality, and every puff is a celebration of the finest fruity Weed oil flavors.\nTry it today and elevate your vaping game to new heights! Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A, Strains: N\/A 1490"
  },
  {
    "product":"WEST COAST CURE Bar Premium Disposable WEST COAST CURE BAR PREMIUM DISPOSABLE\nThe WEST COAST CURE Bar  Disposable is a highend vaping device, notable for its ceramiccore atomizer, dentalgrade materials, and rechargeable battery. Its design focuses on providing a consistent, quality vaping experience. WCC CURE Bar is a stateoftheart vaping device, designed for those who seek quality and convenience in one sleek package!\n WEST COAST CURE Bar  The Outstanding Cannabis Disposable Vape\nThe WEST COAST CURE Bar  Disposable is a highend vaping device, notable for its ceramiccore atomizer, dentalgrade materials, and rechargeable battery. Its design focuses on providing a consistent, quality vaping experience. WCC CURE Bar is a stateoftheart vaping device, designed for those who seek quality and convenience in one sleek package!\n\nAdvanced Features of WCC Curebar Disposable\n\nInnovative CeramicCore Atomizer Ensures consistent heating and optimal flavor.\nPremium Materials Crafted with dentalgrade components for safety and quality.\nRechargeable Battery Reliable and longlasting for extended use.\nSleek, Portable Design Perfect for discreet, onthego vaping.\n\n \n               \nWest Coast Curebar Quality You Can Trust\n\nQuality Assurance Rigorously tested to ensure consistent potency and safety.\nFlavorful Vaping Enjoy a wide\n range of sumptuous flavors, crafted for a memorable experience.\nRigorous Testing Each unit is meticulously tested for quality assurance.\n\n\nTips How to change the Voltage Level of Curebar Disposable ?\nTo change the voltage mode on the WCC CURE Bar, You just have to press the button three times. This will cycle to the next voltage level. The device show the current power level with a light green for low, blue for medium, and red for high. This feature allows you to customize your vaping experience according to your preference for heat and vapor intensity. Remember, its always a good idea to start at the lowest setting and gradually increase to find your ideal level. If you dont know what is your ideal level? Learn more on our Cannabis vape 101 guide\n\n\nWhy Choose WEST COAST CURE Bar?\nThe WEST COAST CURE Bar Premium Disposable is a highend vaping device, notable for its ceramiccore atomizer, dentalgrade materials, and rechargeable battery.\nIts design focuses on providing a consistent, quality vaping experience. The product is userfriendly, suitable for both new and experienced vapers\nGet your hands on the WCC CURE Bar Premium Disposable today \nOr Discover more Disposable vape to explore and step into a world of premium vaping at Neverland.OG Bangkok\nFor more detailed information, please visit the WEST COAST CURE website. Strains: N\/A 2090"
  },
  {
    "product":"WEST COAST CURE Bar พรเมยมแบบใชแลวทง WEST COAST CURE BAR พรเมยมแบบใชแลวทง\nWEST COAST CURE Bar แบบใชแลวทงเปน อปกรณสบไอระดบไฮเอนด โดดเดนดวย เครองฉดนำแกนเซรามก วสดเกรดทนตกรรม และแบตเตอรแบบชารจไฟได การออกแบบมงเนนไปทการมอบประสบการณการสบไอทมคณภาพสมำเสมอ WCC CURE Bar เปน อปกรณสบไอลำสมย ออกแบบมาสำหรบผทตองการคณภาพและความสะดวกสบายในแพคเกจททนสมยเพยงอนเดยว!\n WEST COAST CURE Bar  Vape กญชาแบบใชแลวทงทโดดเดน\nWEST COAST CURE Bar แบบใชแลวทงเปน อปกรณสบไอระดบไฮเอนด โดดเดนดวย เครองฉดนำแกนเซรามก วสดเกรดทนตกรรม และแบตเตอรแบบชารจไฟได การออกแบบมงเนนไปทการมอบประสบการณการสบไอทมคณภาพสมำเสมอ WCC CURE Bar เปน อปกรณสบไอลำสมย ออกแบบมาสำหรบผทตองการคณภาพและความสะดวกสบายในแพคเกจททนสมยเพยงอนเดยว!\n\nคณสมบตขนสงของ WCC Curebar แบบใชแลวทง\n\nนวตกรรมเครองฉดนำแกนเซรามก  รบประกนความรอนสมำเสมอและรสชาตทเหมาะสม\nวสดระดบพรเมยม  สรางขนดวยสวนประกอบเกรดทนตกรรมเพอความปลอดภยและคณภาพ\nแบตเตอรแบบชารจไฟได  เชอถอไดและมอายการใชงานยาวนาน\nการออกแบบเพรยวบางและพกพาได  สมบรณแบบสำหรบการสบไอระหวางเดนทางอยางสขมรอบคอบ\n\n \n \nคณภาพการรกษาของ West Coast Curebar ทคณวางใจได\n\nการประกนคณภาพ  ผานการทดสอบอยางเขมงวดเพอใหมนใจถงประสทธภาพและความปลอดภยทสมำเสมอ\nสบไออยางมรสชาต  เพลดเพลนไดหลากหลาย\n หลากหลายรสชาตอนหรหรา รงสรรคขนเพอประสบการณอนนาจดจำ\nการทดสอบอยางเขมงวด  แตละหนวยไดรบการทดสอบอยางพถพถนเพอการประกนคณภาพ\n\n\nเคลดลบ จะเปลยนระดบแรงดนไฟฟาของ Curebar แบบใชแลวทงไดอยางไร\nหากตองการเปลยน โหมดแรงดนไฟฟาบน WCC CURE Bar คณเพยงแคกดปมสามครง สงนจะวนไปทระดบแรงดนไฟฟาถดไป อปกรณแสดงระดบพลงงานปจจบนพรอมไฟ สเขยวสำหรบตำ สนำเงนสำหรบปานกลาง และสแดงสำหรบสง คณสมบตนชวยใหคณปรบแตงประสบการณการสบไอไดตามความตองการดานความรอนและความเขมขนของไอ โปรดจำไววา เปนความคดทดเสมอทจะเรมตนจากการตงคาตำสดและคอยๆ เพมขนเพอคนหาระดบในอดมคตของคณ หากคณไมรวาระดบในอดมคตของคณคอระดบใด? เรยนรเพมเตมเกยวกบ คมอ Cannabis vape 101 ของเรา\n\n\nเหตใดจงเลอก WEST COAST CURE Bar\nWEST COAST CURE Bar Premium Disposable เปนอปกรณสบไอระดบไฮเอนด โดดเดนดวยเครองฉดนำแกนเซรามก วสดเกรดทนตกรรม และแบตเตอรแบบชารจไฟได\nการออกแบบมงเนนไปทการมอบประสบการณการสบไอทมคณภาพสมำเสมอ ผลตภณฑนเปนมตรกบผใช เหมาะสำหรบทงผสบไอใหมและมประสบการณ\nเปนเจาของ WCC CURE Bar Premium Disposable ไดแลววนน \nหรอคนพบ vape แบบใชแลวทง เพมเตมเพอสำรวจและกาวเขาสโลกแหง การสบไอระดบพรเมยมท Neverland.OG กรงเทพฯ\nสำหรบขอมลโดยละเอยดเพมเตม กรณาเยยมชม เวบไซต WEST COAST CURE Strains: N\/A 2090"
  },
  {
    "product":"WYLD Premium THC Gummies Elevate your cannabis experience with WYLD Premium THC Gummies, crafted with real fruit and enhanced with carefully selected cannabis terpenes.\nAvailable in a variety of tantalizing flavors, each offering unique tastes and effects.\n Discover the perfect gummy for your needs, whether its relaxation, sleep support, focus, or a balanced high.\nShop now for wyld gummies, wyld thc gummies, and wyld edibles in Bangkok at Neverland Weed Shop WYLD Premium THC Gummies\n\nElevate your cannabis experience with WYLD Premium THC Gummies, a toptier selection of cannabisinfused edibles that tantalize your taste buds and invigorate your senses.\nEach gummy is meticulously crafted using real fruit ingredients and enhanced with carefully selected cannabis terpenes to deliver an unparalleled experience.\nAvailable Flavors and Effects\n\nElderberry THCCBN  Indica Indulge in the rich, berry flavor of Elderberry gummies, designed to promote deep, restful sleep. The combination of THC, CBN, and indica terpenes may provide enhanced sedative effect.\nBoysenberry THCCBDCBN  Indica Savor the succulent taste of Boysenberry gummies, formulated for deep relaxation and rejuvenating sleep. The blend of THC, CBD, CBN, and indica terpenes offers a synergistic effect that may lead to greater restorative rest.\nMarionberry THC  Indica Unwind with the delightful taste of Marionberry gummies, the only WYLD gummies featuring indica genetics. Perfect for relaxation at the end of a long day or as a gentle sleep aid.\nRaspberry THC  Sativa Energize your day with the tangy taste of Raspberry gummies, infused with sativaderived terpenes.\nIdeal for boosting focus, creativity, and motivation.\nHuckleberry THC  Hybrid Experience the perfect balance with Huckleberry hybrid gummies, offering a delightful blend of relaxation and euphoria. Great for uplifting your mood and promoting overall wellbeing.\nBlood Orange THCCBC  Sativa Awaken your senses with the zesty flavor of Blood Orange gummies, enhanced with CBC and sativa terpenes. Perfect for creative pursuits, social gatherings, or energizing adventure.\n\n\nWhy Choose WYLD Premium THC Gummies?\nWYLD Premium THC Gummies are crafted with the utmost care and attention to detail, ensuring a consistently exceptional experience. Made with real fruit ingredients and natural flavors, these gummies offer an authentic, truetofruit taste that sets them apart from the competition.\nThe precise dosing and rigorous quality control guarantee reliable potency and uncompromising quality in every batch.\nElevate your cannabis journey with these toptier edibles, available now at Neverland Weed Shop in Bangkok. Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A, Flavors: N\/A 1790"
  },
  {
    "product":"Watermelon Mimosa Strain  Hybrid Sativa Experience the refreshing and potent Watermelon Mimosa Strain, a hybrid Sativa dominant cannabis flower that combines the sweet aroma of watermelon with the energizing effects of Mimosa.\nPerfect for daytime use, this strain offers a balanced blend of relaxation and focus. Watermelon Mimosa Strain  Hybrid Sativa\nIndulge in the delightful Watermelon Mimosa Strain, a hybrid cannabis flower that brings together the best of both worlds.\nThis strain is renowned for its sweet and refreshing watermelon aroma, making it a favorite among cannabis enthusiasts.\nThe Watermelon Mimosa Strain is a cross between the popular Mimosa and Watermelon Zkittlez strains, resulting in a unique and potent flower.\nKey Features\n\nAroma Sweet and refreshing watermelon scent that tantalizes the senses.\nEffects Energizing and uplifting, perfect for daytime use. Offers a balanced blend of relaxation and focus.\nPotency Known for its moderate to high THC levels, ensuring a satisfying experience.\nAppearance Vibrant green buds with hints of purple and orange, covered in a layer of sticky trichomes.\nFlavor Tastes of sweet watermelon with hints of citrus and earthy undertones.\n\nWhy Choose Watermelon Mimosa Strain?\nThe Watermelon Mimosa Strain is ideal for those seeking a daytime cannabis experience that combines energy and focus with a touch of relaxation.\nThis strain is perfect for creative activities, social gatherings, or simply enjoying a sunny day.\nWith its unique aroma and balanced effects, the Watermelon Mimosa Strain is a musttry for any cannabis connoisseur.  450"
  },
  {
    "product":"White Truffle Strain  Hybrid Indica White Truffle is an Indicadominant hybrid known for its potent effects and unique flavor profile this strain offers a calming and euphoric experience, perfect for unwinding after a long day.\nEnjoy its earthy, skunky aroma and rich, savory taste. White Truffle Strain  Hybrid Indica\nWhite Truffle, an Indicadominant hybrid, is a powerhouse strain renowned for its potent effects and unique flavor profile.\nOriginating from a cross of Gorilla Butter, making it ideal for experienced users seeking a strong, relaxing high.\nThe strains effects are quickhitting, providing a euphoric head high that transitions into a calming body experience.\nKey Features\n\nHigh Potency THC levels between 18 and 26, perfect for experienced users.\nUnique Flavor Profile Earthy, skunky aroma with savory, nutty, and slightly sweet undertones.\nIndicaDominant Provides a calming and relaxing experience, ideal for evening use.\nMedical Benefits Effective for treating stress, anxiety, depression, and chronic pain.\nAppearance Dense, spadeshaped buds with deep purple foliage and frosty white trichomes.\n\nWhy Choose White Truffle?\nWhite Truffle is perfect for those looking to unwind and relax after a long day.\nIts unique terpene profile, including caryophyllene, limonene, and humulene, contributes to its rich and complex flavor.\nWhether youre seeking relief from stress or simply looking to enjoy a potent, flavorful strain, White Truffle is an excellent choice.\nUsage Tips\n\nBest enjoyed in the evening due to its relaxing effects.\nStart with a small amount to gauge your tolerance, especially if youre new to highTHC strains.\nStore in a cool, dark place to maintain freshness and potency.  450"
  }
]