[{
  "text": "POLKADOT Magic Mushrooms Chocolate | Neverland\nPolkadot: Magic Mushrooms Chocolate\nPolkadot is a leading brand specializing in Magic Mushrooms Chocolate, offering a delicious and innovative way to experience the benefits of magic mushrooms.\nAt Neverland Weed Shop, we are proud to bring you a curated selection of Polkadot mushrooms products, designed for both newcomers and experienced users.\nPolkadot’s Magic Mushrooms Chocolate is crafted with premium ingredients and infused with high-quality mushroom extracts, providing a consistent and enjoyable experience.\nWhether you’re interested in microdosing or a full psychedelic journey, Polkadot offers a variety of options to suit your needs.\nWhy Choose Polkadot?\nPremium Magic Mushrooms Chocolate\nHigh-quality ingredients and extracts\nConsistent potency and flavor\nVariety of dosing options\nExplore our collection of Polkadot products and find the perfect Magic Mushrooms Chocolate for you. Each piece is carefully crafted to ensure a balanced experience, with flavors that make it a delightful treat.\nShop Polkadot at Neverland.OG\nVisit our Polkadot collection to discover the best-selling Magic Mushrooms Chocolate and other unique products.\nAt Neverland Weed Shop, we guarantee authenticity and quality in every item we offer.\nSale!\nPolkadot Magic Mushroom Chocolate | 4g of Mushroom per box!\nOriginal price was: 1,990฿.Current price is: 1,750฿. Select options This product has multiple variants. The options may be chosen on the product page \nPolkadot Magic Mushrooms Chocolate\nPackage Contents: Each box contains 4 grams of high-quality magic mushrooms.\nExquisite Flavor Selection:\nGood Luck Charms: A whimsical blend of marshmallow and cereal bits for a nostalgic treat.\nButterlicious: Creamy, rich butter-infused chocolate for a smooth and luxurious taste.\nCinnamon French Toast: Spiced with cinnamon and a hint of sweetness, mimicking the beloved breakfast dish.\nCookies n’ Cream: Classic and beloved, with crunchy cookie bits swirled in creamy white chocolate.\nHorchata: Inspired by the traditional drink, with notes of cinnamon and vanilla in a comforting chocolate form.\nDark Intense: For the purists, a deep, rich dark chocolate that satisfies the need for intensity.\nKrispy Chocolate Crunch: A playful crunch meets smooth chocolate for a texturally dynamic bite.\nS’More: A campfire favorite reimagined in chocolate, with hints of marshmallow and graham cracker.\nPremium Quality Ingredients: Expertly dosed with psilocybin and crafted with the finest chocolates for a consistently delightful experience.",
  "url": "https://neverlandweedshop.com/brands/polkadot/"
},
{
  "text": "Cosmic Fog brand | Neverland.OG\nExperience Cosmic Fog: The Best in Vaping\nCosmic Fog is a leading vape brand, known for its innovative flavors and high-quality vape juices.\nAt Neverland Weed Shop, we bring you a range of Cosmic Fog products that offer a unique and enjoyable vaping experience.\nCosmic Fog brand focuses on creating vape juices that are not only delicious but also safe.\nEach product is rigorously tested to ensure it meets the highest standards of quality.\nWith a wide variety of flavors, Cosmic Fog is a top choice among vapers in Thailand.\nWhy Cosmic Fog is a Top Vape Brand\nInnovative and diverse flavors\nHigh-quality ingredients\nRigorous safety and quality testing\nStylish and eye-catching packaging\nExplore our selection of Cosmic Fog vape juices and find the perfect flavor for your taste.\nShop Cosmic Fog Products\nVisit our Cosmic Fog collection to find the best vape juices in Thailand. At Neverland Weed Shop, we ensure every product is authentic and of the highest quality.",
  "url": "https://neverlandweedshop.com/brands/cosmic-fog/"
},
{
  "text": "MELT Premium Cannabis Disposables | Neverland.OG\nMelt: Premium Cannabis Disposables\nAt Neverland Weed Shop, we are proud to be an authorized distributor of Melt products in Thailand.\nMelt is a premium brand from California specializing in high-quality disposable cannabis vapes, offering a convenient and enjoyable vaping experience.\nWe carry a selection of Melt Exotics 2g Disposable and Melt Live Resin 2g Disposable, catering to various preferences and tastes.\nMelt’s disposables are known for their potency and smoothness, thanks to top-quality cannabis extracts and state-of-the-art production techniques.\nWhether you prefer exotic flavors or the rich profile of live resin, Melt has something for everyone.\nWhy Choose Melt?\nHigh-quality cannabis disposables\nConvenient and easy to use\nPotent and smooth vaping experience\nVariety of flavors and strains\nExplore our collection of Melt products, where you’ll find a range of disposables to suit your preferences.\nWhether you’re looking for a quick and convenient option or a premium vaping experience, Melt has it all.\nShop Melt at Neverland.OG\nVisit our Melt collection to discover the best Melt products in Thailand. As an authorized distributor, we guarantee authenticity and quality in every item we offer\nSale!\nMelt THCA Diamonds Live-Resin Disposable 2g\nOriginal price was: 2,600฿.Current price is: 2,490฿. Select options This product has multiple variants. The options may be chosen on the product page \nThe Melt THCA Diamonds Live-Resin Disposable 2g offers a premium vaping experience, combining the potency of THCA diamonds with the rich, full-spectrum benefits of live resin!\nMELT AMF Exotic Liquid Diamonds 2g\n2,490฿ Select options This product has multiple variants. The options may be chosen on the product page \nExperience a symphony of taste with MELT Exotic Liquid Diamonds disposables. Each carefully crafted strain offers a unique, mouthwatering flavor profile that tantalizes the senses. Elevate your vaping experience with premium, terpene-packed cannabis extracts that prioritize exceptional taste and aroma.\nAvailable Flavor..\nBlueberry Tart – Hybrid\nDewlato – Indica\nLemon Blast – Sativa\nPink Bubblegum – Hybrid\nWatermelon Lush – Hybrid",
  "url": "https://neverlandweedshop.com/brands/melt/"
},
{
  "text": "TRE HOUSE Magic Mushrooms Vapes & Edibles\nTRE HOUSE: Premium Magic Mushrooms Experience\nWelcome to the world of TRE HOUSE, where Magic Mushrooms vapes and edibles are crafted with precision and care.\nAt Neverland Weed Shop, we are proud to offer TRE HOUSE products, a brand synonymous with quality and innovation in the world of psychedelics.\nEach Magic Mushrooms vape and edible from TRE HOUSE is designed to provide a transformative experience, combining potent psilocybin with delicious flavors.\nThese products are perfect for those seeking to explore the therapeutic and recreational benefits of psilocybin in a controlled and enjoyable way.\nExperience the Difference with TRE HOUSE\nInnovative Magic Mushrooms vapes and edibles\nHigh-quality, safe, and reliable products\nDiverse range of experiences tailored to user preferences\nFlavorful options that enhance each session\nExplore the unique offerings of TRE HOUSE at Neverland Weed Shop and elevate your experience with our carefully selected range of Magic Mushrooms products.\nDiscover TRE HOUSE Products\nCheck out our TRE HOUSE collection for a premium selection of Magic Mushrooms vapes and edibles that redefine the psychedelic experience.\nSale!\nTRE HOUSE | Live Resin HHC Vape Pen\nOriginal price was: 2,590฿.Current price is: 2,290฿. Select options This product has multiple variants. The options may be chosen on the product page \nTRE HOUSE’s Live Resin HHC Vape Pen offers 2g of highly potent HHC for a truly unforgettable experience\nwith a rechargeable and disposable design for maximum convenience.\nSale!\nTRE HOUSE | THC-A Live Resin Liquid Budder Vape Pen\nOriginal price was: 2,890฿.Current price is: 2,450฿. Select options This product has multiple variants. The options may be chosen on the product page \nUnlock the Power of THC-A with TRE HOUSE Discover the ultimate vaping experience with TRE HOUSE’s THC-A Live Resin Liquid Budder Vape Pen\nTRE HOUSE Magic Mushroom Vape 2g\nOriginal price was: 3,890฿.Current price is: 3,500฿. Select options This product has multiple variants. The options may be chosen on the product page \nGet ready to soar with TRE HOUSE Magic Mushrooms Vape!\nThis super convenient vape bursts into action right out of the box with 2g of our finest magic mushroom blend.\nExpect around 800 vibrant puffs of delicious pink lemonade flavor, perfect for anyone in Thailand looking to spice up their routine with some psychedelic fun. Just unpack, puff, and let the magic take over!\nTRE HOUSE | THC Delta9 Gummies with CBD 1:1 400mg\nOriginal price was: 1,690฿.Current price is: 1,350฿. Add to cart \nTRE HOUSE | THC Delta9 Gummies with CBD 1:1 400mg\n20mg full-spectrum CBD per serving\nTastes like a combination of fresh peaches & pears\nCan get you super baked\nVegan & gluten-free\n1 gummy per serving\n20 or 40 gummies per bottle\nWarning: May cause psychotropic effect",
  "url": "https://neverlandweedshop.com/brands/tre-house/"
},
{
  "text": "Same-Day Weed Delivery Bangkok & Buy Weed Online\nImagine you’re planning a relaxing evening or a get-together with friends but you realize you’re out of your favorite strain. There’s no need to worry. At Neverland Weed Shop, we understand that sometimes, you need your cannabis delivered fast. That’s why we offer same-day delivery across Bangkok. Just place your order, and before you know it, high-quality cannabis will be at your door, discreetly and securely.\nNot in Bangkok? No problem! Your location in Thailand doesn’t keep you from experiencing the best cannabis products. Our nationwide delivery service ensures that you receive your order swiftly within 1-3 days. We use trusted delivery partners (Kerry Express) to ensure that your order is handled with care and arrives on time.\nFor those who prefer a more personal touch, our local weed shop in Bangkok is the perfect place to visit. Step into our welcoming shop, you can explore our products up close and learn about different cannabis products firsthand. Our staffs are passionate about helping you find the perfect product to suit your needs and style.",
  "url": "https://neverlandweedshop.com/weed-delivery-bangkok/"
},
{
  "text": "Blog / Articles - Neverland.OG\nAll\nBlog\nUncategorized @th\nExplore the latest insights and trends in cannabis with Neverland Weed Shop’s blog. Dive into expert advice, industry news, and engaging content tailored for cannabis enthusiasts in Thailand. Join our community today!\nPick your weapon: joints, bongs or edibles\nBlog\nChoosing how to consume your cannabis is an important decision that you will inevitably need to make. Your favourite method […]\nCan cannabis be a natural medicinal remedy?\nBlog\nTo many, cannabis has always been a special player in the category of natural remedies and medicine. Containing over 100\nDoes cannabis actually help you sleep better?\nBlog\nPeople have been using cannabis as a sleep aid for some time now, and many users see the benefit of\nCreative things to do while high \nThe legalization of recreational cannabis in Thailand has only made the plant more socially accepted and mainstream. People are discovering\nWhat Is the Difference Between Melt Live Resin Disposable and Melt Exotics Disposable?\nWhen it comes to choosing the right vape, understanding the effects of different products is crucial. If you’re torn between\nWhat’s Different: Benefits of THC Delta-8, Delta-9, Delta-10, HHC, THC-a and THC-p?\nTable of Contents The THC Family: Unpacking the Unique Benefits of Delta-8, Delta-9, Delta-10, HHC, THC-a and THC-p Hey there,\nSuper Lemon Haze Strain: Effects, Flavor, and Where to Find It at Big Chief\nCannabis enthusiasts and connoisseurs are always on the lookout for strains that offer a perfect blend of flavor, potency, and\nThe Ultimate Guide to Big Chief Disposables: Unveiling the Wonders of Live Resin\nWhy Big Chief Live Resin Disposables Are a Must-Try for Cannabis Enthusiasts? Introduction In the vibrant world of cannabis, few\nProduct Review: Jungle Boys Live-Resin\nExploring the Magic of Jungle Boys Live Resin: A Cannabis Connoisseur’s Delight Introduction In the enchanting world of cannabis, few\nLow and slow: a beginners guide for cannabis consumption\nTrying cannabis for the first time can be an exciting but daunting prospect. Searching online, you are bombarded by a\nChoosing the right cannabis strain for you\nCannabis, with its history of recreational use, has an innumerable list of strains which offer different effects and experiences. Even\nChoosing the perfect places for using cannabis\nThere are a variety of factors which will impact your experience with cannabis, but one that is highly underrated is",
  "url": "https://neverlandweedshop.com/category/blog/"
},
{
  "text": "What's Hot in Thailand & Why?\nUnlock the World of Premium Vaping! 🌍✨ Discover why these Global Superstars are the must-haves for Thc Vapers in Thailand. Ready, Set, Vape!\nThe landscape of THC vaping in Thailand is vibrant and dynamic, with 2024 poised to be a landmark year for cannabis enthusiasts. By choosing brands that align with the highest standards of quality, innovation, and reliability. you can ensure a superior vaping experience. Dive into the future of cannabis with Neverland.OG Weed Shop and let’s explore the possibilities together.",
  "url": "https://neverlandweedshop.com/best-thc-vape-brands-2024/"
},
{
  "text": "Magic Mushrooms Vs Cannabis | Perfect Natural Companion\nMagic Mushroom Vs. Cannabis: Discovering Your Perfect Match in Nature's Pharmacy\nHello, Neverland OG’s friends! Are you excited to learn more about some really special gifts from nature?\nWhether you’re looking to find deeper meaning in life, spark your creativity or just relax?\nGetting to know Magic Mushrooms and Cannabis can help you find the perfect natural friend.\nWelcome to our fun and easy guide at NEVERLAND.OG where we help you understand the differences between magic mushrooms and cannabis.\nThese two natural helpers can offer very different experiences and we’re here to explain how they are not the same.\nLet’s dive in and learn about them in simple words!\nMagic Mushroom Vs Cannabis: Discovering Your Perfect Match in Nature's Pharmacy\nMagic Mushrooms: A Wonderful Journey for Deep Thinkers\nDo you love to think deeply and explore big questions?\nAre you interested in feeling a strong connection to the world around you or just need a break from everyday life?\nIf so, Magic Mushrooms could be just what you’re looking for.\nThey’re like a special friend from nature who can take you on amazing journeys inside your mind and help you feel closer to the universe.\nWhen you try Magic Mushrooms, you might feel like you’re going on an adventure inside your mind and your eyes too…\nYes, you will see many color the wall will melted even your eyes still open.\nThey can help you see things differently, feel more connected to everything, and discover new ideas or insights that you never knew before.\nIt’s like opening a door to a magical world where you can learn more about yourself and the universe.\nThese Mushrooms are perfect for people who love to think, create or search for deeper understanding. \nThey can help you see the world in new and exciting ways, Whether you’re an artist looking for inspiration, a thinker pondering life’s big questions or someone curious about exploring your inner self.\nFor your mind, they can help you see things differently feel more connected to everything and Maybe you can discover a new ideas or insights that you never knew before.\nSo, if you’re the kind of person who enjoys deep thoughts, feels a pull toward exploring the unknown or just wants to experience something truly special, Magic Mushrooms might be the perfect natural ally for you.\nThey offer a unique chance to dive deep into your thoughts and feelings and see the world in a brand new light.\nCannabis: A Gentle Companion for Creative Minds and Relaxation Seekers\nDo you enjoy letting your imagination soar or finding peace in your busy life?\nCannabis might be the gentle friend from nature you’re seeking. \nIt offers a comforting hand, guiding you to relax, create and enjoy the moment with a lighter heart.\nCannabis is ideal for those who cherish creativity, relaxation or a joyful lift in their daily routine.\nIt can spark new ideas, soothe your thoughts or simply add a touch of pleasure to your activities.\nWhen you choose Cannabis, it’s like stepping into a welcoming warm embrace. \nIt can ease your worries, enhance your senses and bring a smile to your face.\nImagine listening to your favorite music you will feeling every note more deeply or savoring the flavors of a delicious meal with heightened pleasure.\nCannabis opens up a space where the simple joys of life become richer and more vibrant.\nFor those who love to explore their creativity find serenity in their day or just enjoy life’s little pleasures, cannabis can be your perfect companion.\nIt offers a gentle lift or a calming breath, helping you navigate your world with a lighter spirit and a joyful heart.\nSo, if you’re someone who appreciates moments of joy, seeks peace amid chaos or desires to unleash your creative spirit, Cannabis could be your ideal natural friend.\nDiving Deeper: Understanding Your Match\nBy now, you might be wondering which path to tread.\nHere’s a more nuanced look to help you find your match.\nThese two natural helpers can offer very different experiences, and we’re here to explain how they are not the same.\nLet’s dive in and learn about them in simple words!\nJourney into Your Mind vs. Relaxing Chill\nMagic mushrooms \nare like a deep adventure into your thoughts and feelings.\nThey can change how you see and feel about the world around you, making everything seem new and interesting.\nCannabis\nis like a gentle friend who brings you calm and happiness.\nIt doesn’t take you on a wild ride but makes you feel good and relaxed, adding a little extra joy to what you’re already doing.\nHappy Feelings vs. Peaceful Times\nWhen you use Magic Mushrooms, you might feel very happy in a big, life-changing way. They can make you think about big questions and feel connected to everything.\nCannabis brings a softer kind of happiness. It can help you feel comfy and at ease, making everything a bit more fun, like listening to music or hanging out with friends.\nWhat You Feel and Think\nMagic mushrooms mostly affect your mind, making your thoughts and what you see very different. You might feel like time is stretching or see colors and shapes that aren’t there.\nCannabis can make your body and mind feel good. Depending on the kind, it can either help you relax and get rid of stress or make you feel energized and full of ideas.\nHow Long It Lasts\nA trip on magic mushrooms can last for several hours, taking you on a long journey where you might learn new things about yourself.\nThe feelings from cannabis don’t last as long, which means you can enjoy it and still feel normal again after a little while.\nHelping You Feel Better\nScientists are studying Magic Mushrooms for helping with big problems like feeling very sad or having bad memories that stick around.\nCannabis is known to help with lots of different things. It can take away pain, make you worry less, or help you sleep better.\nWhat’s Best for You?\nNow you know more about how Magic Mushrooms and Cannabis are different. \nMagic mushrooms can take you on a big adventure in your mind, while Cannabis is more about feeling good and relaxed.\nDepending on what you’re looking for, one might be better for you than the other.\nRemember, whether you’re curious about trying something new or just want to feel a little better, it’s important to be safe and know what’s right for you.\nAnd here at NEVERLAND.OG we’re always here to help guide you on your journey!\nHope my blog post be helpful for all new trips adventure!\nHope you guys have a Good Trips! \nxoxo\nJunejune\nSale! \nCreative things to do while high \n25/09/2024 No Comments \nThe legalization of recreational cannabis in Thailand has only made the plant more socially accepted and mainstream. People are discovering new and creative ways to\nRead More »",
  "url": "https://neverlandweedshop.com/magic-mushrooms-vs-cannabis/"
},
{
  "text": "How Weed Strains Impact Creative Process?\nHow Different Varieties Impact the Creative Process?\nThe intertwining of cannabis use and creativity has long been a topic of fascination and study. Many artists, musicians, writers, and creators credit Weed pen as a catalyst for their creative processes, enhancing imagination, breaking through creative blocks, and offering new perspectives. However, not all weed strains are created equal when it comes to sparking creativity.\nThe impact of cannabis on the creative process can vary significantly depending on the strain’s unique chemical makeup, including its cannabinoids and terpenes. This article delves into how different weed strains can influence creativity, providing insights for those looking to harness cannabis as a tool for creative expression.\nBefore exploring specific strains, it’s essential to grasp the basic categories of cannabis: Sativa, Indica, and hybrid. Traditionally, Sativa strains are associated with more energizing and uplifting effects, which can stimulate the mind and enhance creativity.\nIndica strains, on the other hand, are often linked with relaxation and a calming sensation, which might be less conducive to active creative work but beneficial for brainstorming or conceptual thinking. Hybrid strains offer a mix of these effects, potentially providing a balanced approach to creativity.\n\nThe Role of THC and CBD\nThe two primary cannabinoids, THC (tetrahydrocannabinol) and CBD (cannabidiol), play significant roles in how cannabis affects the user. THC is the psychoactive component known for its euphoric and mind-altering effects, which can either enhance or hinder creativity depending on the individual’s response and the strain’s potency.\nCBD, which is non-psychoactive, can mitigate some of the anxiety or paranoia that higher THC levels might induce, potentially leading to a more relaxed state conducive to creative thought.\nJack Herer\nNamed after the renowned cannabis activist, Jack Herer is a Sativa-dominant strain known for its cerebral elevation and creative stimulation. Its piney aroma, courtesy of the terpene pinene, can enhance alertness and clear the mind, making it ideal for writing, brainstorming, and other creative endeavors that require focused thought.\nBlue Dream\nA popular hybrid strain, Blue Dream balances full-body relaxation with gentle cerebral invigoration. Its effects are mildly euphoric and uplifting, fostering creativity without the intense rush that some more potent Sativas might produce. This makes Blue Dream a good choice for those who prefer a smoother, more balanced creative session.\nSuper Lemon Haze\nAnother Sativa-dominant strain, Super Lemon Haze, is celebrated for its energetic and lively effects. The zesty citrus aroma is invigorating, potentially sparking creativity and productivity. This strain is particularly favored by those engaged in artistic projects that require stamina and an upbeat mood.\nPurple Haze\nWith its dreamy, euphoric effects and a creative buzz, Purple Haze is a Sativa-dominant strain that can unlock the doors of perception. Named after the Jimi Hendrix song, it’s no surprise that this strain is a favorite among musicians and artists looking to tap into their subconscious and explore new ideas.\nStrains for Creative Reflection\nNorthern Lights\nAn Indica-dominant strain, Northern Lights, is famed for its ability to relax the mind and body. This strain might be more suited to creative activities that benefit from introspection and deep thought, such as conceptualizing art pieces or developing complex narratives.\nGranddaddy Purple\nFor those seeking a strain that encourages mental unwinding and the flow of abstract ideas, Granddaddy Purple can be a perfect choice. Its calming effects can be just what’s needed for late-night writing sessions or exploring new artistic concepts without the pressure of immediate productivity.\nGranddaddy Purple\nFor those seeking a strain that encourages mental unwinding and the flow of abstract ideas, Granddaddy Purple can be a perfect choice. Its calming effects can be just what’s needed for late-night writing sessions or exploring new artistic concepts without the pressure of immediate productivity.\nTips for Using Cannabis Creatively\n● Start Low and Go Slow: Especially if you’re experimenting with a new strain, it’s wise to start with a low dose and gradually increase as needed to avoid overwhelming effects that might hinder creativity.\n● Setting Matters: Create a conducive environment for creativity before consuming cannabis. This might include gathering art supplies, setting up a comfortable workspace, or curating a playlist to inspire you.\n● Mix Strains with Caution: Combining strains can either enhance creativity or lead to unwanted effects. It’s important to understand how different strains affect you individually before mixing them.\nThe Importance of Terpenes\nBeyond THC and CBD, the terpenes present in cannabis strains play a crucial role in modulating the effects of cannabis, including its impact on creativity. Terpenes are aromatic compounds found in many plants, including cannabis, and they can influence mood, stress levels, and even cognitive function. For example, limonene, commonly found in\ncitrus-scented strains, is associated with mood elevation and stress relief, potentially aiding the creative process by fostering a positive mindset.\n\nCreative Blocks and Cannabis\n\nCreatives often turn to cannabis not just for direct inspiration but also as a tool for overcoming creative blocks. The altered state of mind induced by cannabis can help break down mental barriers and encourage lateral thinking, enabling artists to approach their work from new angles. However, it’s crucial to find the right strain and dosage, as too much THC can lead to overstimulation and exacerbate creative blocks for some individuals.\nCollaborative Creativity\nCannabis can also enhance collaborative creative efforts. For groups of artists working together, certain strains may promote social interaction and verbal fluency, making brainstorming sessions more productive and enjoyable. This communal aspect of creativity can be significantly enriched by the thoughtful selection of cannabis strains that align with the group’s creative goals.\nPersonalization and Experimentation\nThe relationship between cannabis and creativity is highly individualized. What works for one person might not work for another, underscoring the importance of personal experimentation. Keeping a journal of your experiences with different strains,, can help identify patterns and preferences over time. This personalized approach ensures that cannabis serves as a catalyst for creativity in a way that aligns with your unique artistic process.\n\nConclusion\nCannabis can be a powerful tool for creative expression, with different strains offering varied effects that can either stimulate or soothe the mind. Whether seeking a burst of creative energy, a new perspective on a project, or a calm space for reflection, there’s likely a weed strain that can assist in the creative process.\nRemember, the subjective nature of cannabis",
  "url": "https://neverlandweedshop.com/how-weed-impact-creativity/"
},
{
  "text": "What is Dabbing & How To Smoke Dabs ?\nDiving Into the World of Dabbing: What is Dabbing ?\nCurious about the buzz around dabbing in the cannabis community? You’re in the right place. Dabbing is not just a dance move; it’s a way to experience cannabis that’s all about potency and purity. Let’s unwrap the mystery of dabbing and discover why it’s becoming the go-to for enthusiasts seeking a deeper dive into the essence of cannabis concentrates.\nWhat Exactly is Dabbing? And, What’s a Dab?\nDabbing is a technique for consuming cannabis that’s a bit like venturing into “The world of high-definition after years of standard TV.” It involves vaporizing cannabis concentrates. As fondly known as “dabs” to deliver a potent and flavorful experience. Imagine concentrates as the essential oil of the cannabis world, crafted by extracting the most desired compounds from the flower. These dabs come in various forms like shatter, wax, crumble, rosin, and sauce, each with its unique consistency and extraction method.\nTHE PROS And CONS OF DABBING\nLike any great story, dabbing has its highs and lows. Here’s a candid look at what makes it both appealing and daunting.\nThe Power of Potency: The headline feature of dabbing is its potency. Concentrates pack a punch, offering a fast-track to the effects of cannabis with less fuss. It’s like the express lane to your desired destination, making it a favorite for those who appreciate efficiency and intensity in their experience.\nThe Cost of Quality: Quality comes at a price, and concentrates are no exception. The intricate process of extracting those potent oils means they often carry a higher price tag (such as 710 LABS, STIIIZY) than your average flower. It’s a premium experience, but one that might have you keeping a closer eye on your cannabis budget.\nA Time-Saver’s Dream: Time is precious, and dabbing respects that. With its quick heating and consuming process, dabbing is ideal for those who want to enjoy the essence of cannabis without the wait. It’s perfect for the modern cannabis enthusiast looking to fit relaxation into a busy schedule.\nThe Learning Curve: Every art form has its initial hurdles, and dabbing is no exception. Mastering the temperature, equipment, and technique takes a bit of practice. But like all good things, a little patience and persistence go a long way.\nTemperature is your friend here. Too hot, and you’ll scorch the flavors. Too cool, and you won’t unlock the full potential. Aim for that perfect 315-450°F (157-232°C) range to keep things just right.\nDabbing Do’s and Don’ts\nDabbing’s all about respect for the process. Respect the potency, and the people you’re sharing with. Start small, especially if you’re new to the scene. This is potent stuff, and it’s wise to ease into it.",
  "url": "https://neverlandweedshop.com/how-to-smoke-dabs/"
},
{
  "text": "What's to do when you feel \"too High\" on Marijuana?\nHow to Fix Being \"Too High\" on Weed?\nWelcome to the world of cannabis\nCannabis is a plant with both benefits and impacts, but when used excessively or without knowing one’s limits, the effects of being “too High” on marijuana can occur.\nThis article will be your guide on how to take care of yourself if you find yourself in this situation, letting you know there’s no need to worry because there are simple ways to mitigate the effects of being too high on marijuana at home to help you feel better.\nUnderstanding the Effects of Being Too High on Marijuana\nWhy do we feel too high on marijuana?\nBeing too high on marijuana results from THC, the primary psychoactive substance in cannabis, entering the central nervous system, leading to physiological and mental changes.\nThese changes can make us feel relaxed, happy or even dependent at times.\nIf you’re interested in learning more about cannabis flowers and different strains, you can find more information from reliable sources.\nHow does cannabis affect us?\nThe impact of Cannabis varies among individuals, depending on the amount, potency and the person’s sensitivity.\nEffects can include increased feelings of happiness, relaxation and in some cases, anxiety or memory loss.\nRecognizing the Signs and Symptoms of Being Too High on Marijuana What does our body tell us?\nThe physical signs of being too high can be identified by symptoms such as red eyes, dry mouth, increased heart rate and changes in time perception.\nHow do our heart and mind react?\nMentally, you might feel relaxed, happy or even experience changes in visual and auditory perception.\nHowever, some may experience anxiety and undesirable experiences.\nUnlock the Secrets: How to Quickly Recover from Being Too High on Marijuana\nHow to Fix Being \"Too High\" on Weed?\nStay Hydrated!\nOne of the simplest and most miraculous ways to overcome being too high is “Water”\nYes, drink plenty of water!\nIt not only rehydrates your body but also helps reduce dry mouth and improve your mood.\nBreathe Deeply and Relax\nBreathing is a powerful tool to relax from being too high.\nTry taking deep breaths and exhaling slowly to help your body and mind return to a normal state.\nStretch Gently\nStretching is an excellent way to help your body relax.\nNot only does it reduce stress and tension in the body but it also makes you feel better physically and mentally.\nTherapeutic Use of Water and Temperature\nTaking a warm bath or using heat and cold alternately can help your body relax and reduce the symptoms of being too high.\nSoaking your feet in warm water can also alleviate tiredness.\nThe Secret of CBD\nCBD or Cannabidiol is a substance in cannabis that doesn’t get you high but has properties that can reduce anxiety and improve mood.\nUsing CBD might be a good way to feel better without side effects.\nSleep is Key \nRejuvenate your body with good sleep\nQuality sleep is crucial for restoring your body and mind.\nIf you’re having trouble sleeping, try adjusting your sleeping environment to be more conducive, such as reducing light and noise.\nThe Relationship Between Being Too High and Lack of Sleep\nLack of sleep can worsen the effects of being too high, so it’s essential to try to get enough rest.\nWhat to Avoid When Too High on Marijuana?\nAvoid caffeine and alcohol as they can worsen the effects of being too high and stay away from foods or drinks that may make you uncomfortable.\nThe Benefits of Cannabis and Responsible Use\nUsing Cannabis responsibly and knowing your limits not only helps you avoid being too high but also allows you to fully benefit from the “Properties of cannabis” for better health and well-being.\nKnowing your limits and using cannabis responsibly are key to preventing the effects of being too high.\nHere are some ways to avoid facing this situation in the future\nKnow your cannabis\nStudy information about different strains and choose cannabis that meets your needs without exceeding your limits.\nSet usage goals\nDefine your reasons and goals for using cannabis to control the amount and avoid unnecessary use. \nAvoid mixing with other substances\nUsing cannabis with alcohol or other drugs\ncan increase the risk and severity of being too high. \nUse in a Safe Environment\nChoose to use cannabis in a place where you feel comfortable and safe to minimize the risk of undesirable effects.\nListen to your body\nPay attention to signals from your body.\nIf you start feeling unwell or experience any undesirable symptoms, stop using immediately.\nResponsible use of cannabis and knowing your limits not only helps you avoid being too high but also enables you to fully benefit from cannabis for better health and well-being.",
  "url": "https://neverlandweedshop.com/whats-to-do-when-you-feel-too-high-on-marijuana/"
},
{
  "text": "What is Snow Ball - Diamond infused Cannabis Flowers ?\nDiamond infused pre-rolls\nDiamond Infused Pre-Rolls are a premium cannabis product designed for those seeking an exceptionally potent smoking experience. These pre-rolls are made by combining traditional cannabis flower with THCA diamonds, which are a highly concentrated form of cannabis extract.\nWhen these diamonds are added to cannabis flowers in the pre-roll, they elevate the THC content and, consequently, the psychoactive and therapeutic effects of the smoke.",
  "url": "https://neverlandweedshop.com/what-is-snow-ball/"
},
{
  "text": "Live Resin vs Live Rosin vs Distillates? For THC Vape in Thailand\nThailand, with its vibrant culture and evolving legal landscape, has become a new frontier for THC vaping enthusiasts. As the country embraces more progressive views on cannabis, the world of THC vaping is expanding, offering a range of experiences for both locals and visitors. In this realm, three main types of cannabis concentrates have emerged as the frontrunners for vaping: Distillate, Live Resin, and Live Rosin. Each of these offers a unique experience, catering to different preferences and desired effects.\nLive Resin is a cannabis concentrate that has gained significant popularity among THC vaping enthusiasts for its exceptional flavor and aromatic profile. This concentrate is unique in its production process and the experience it offers.\nDistillates represent a pinnacle of purity and potency in the world of THC concentrates. Favoured for their high THC content, distillates offer a straightforward and powerful experience for THC vaping enthusiasts.\nLive Rosin represents the pinnacle of purity and authenticity in the world of THC concentrates. Unlike Live Resin and Distillates, Live Rosin is made through a solventless extraction process, preserving the full spectrum of cannabinoids and terpenes found in the raw cannabis plant. This method involves pressing the cannabis plant material at low temperatures, which extracts a potent, flavorful, and aromatic concentrate.\nLive Rosin represents the pinnacle of purity and authenticity in the world of THC concentrates. Unlike Live Resin and Distillates, Live Rosin is made through a solventless extraction process, preserving the full spectrum of cannabinoids and terpenes found in the raw cannabis plant. This method involves pressing the cannabis plant material at low temperatures, which extracts a potent, flavorful, and aromatic concentrate.",
  "url": "https://neverlandweedshop.com/live-resin-distillate-or-live-rosin/"
},
{
  "text": "How To Spot Fake Muha Meds Disposable\nIn the expanding world of cannabis products, the distinction between real and fake items is crucial. Muha Meds, known for its high-quality cannabis offerings including THC Vapes and Muha Meds Mambas – Gummies, is not immune to the problem of imitation. For consumers in Thailand, it’s essential on how to spot Authenthic Muha Meds disposables to ensure safety and get the best experience.\nTable of Contents \nWhat is The Muha Meds Disposables 2G\nEver wondered why Muha Meds Disposables are the talk of the town? Why it’s the most popular thc vape in Thailand ? Let’s dive in! These little wonders, especially the new 2G version, pack a big punch on value. They bring you top-notch quality, efficiency, convenience and the kind of cannabis experience you’ve been dreaming of. Imagine this: you get the power of premium cannabis in a pocket-sized, easy-to-use form. Perfect for those on-the-go moments or when you just want to keep things low-profile.\nWhy Choose Real Muha Meds ? \nHow To Spot Fake Muha Meds Disposables\nFront Packaging: Your first clue\nback side qr code & label\nthe inside package\nthe strains logo\ninside packaging\nthe link after scan qr code\nAfter you scan the qr code, it should open the browser and navigate to www.muhameds.com/verify other url like muhamedsvip.com = fake\nFinal Step: Identify your Muha Meds by Scan the QR CODE\nLab Testing and QR Codes: Authentic Muha Meds products come with QR codes linking to www.muhameds.com/verify Their “ONLY” Official website, Not muhamedsvip.com Not muhamedsofficial.com. \nPlease carefully check the link you’re going to when you scan the QR Code!\nThe Risks of Fake Muha Meds \nFake products pose significant health risks due to potentially unsafe ingredients and lack of proper lab testing.\nHealth Risks: Using fake products can lead to adverse health effects, making it crucial to ensure authenticity.\nTips to Ensure You're Getting Real Muha Meds\nOffer practical tips for consumers to ensure they purchase authentic products.\nTrusted Sources: Purchase only from the well-known, trusted sources in Thailand\nOfficial Certification: Verify the company’s official certification\nVerify packaging: Authentic products often have distinct packaging with high-quality print, holograms, or QR codes that link to lab results.\nUncategorized @th\n19/03/2024 \n19/03/2024 \nSNOW Ball: Diamond Infused Flowers – Where Potency Meets Luxury \nWhat is Snow Ball: Diamond infused Cannabis Flowers? THC Diamonds are just as eye-catching and are crafted from cannabis. These diamonds can be transformed into many premium products, such as The .SNOW Bud‘s Diamond Infused & THCA Diamond Infused Pre-Rolls, which hit a lot harder than any traditional flowers you’ve ever smoked. In this guide, we’ll explore the Diamond-infused Process, highlighting\n07/02/2024 \n20/01/2024 \nPick your weapon: joints, bongs or edibles \nChoosing how to consume your cannabis is an important decision that you will inevitably need to make. Your favourite method will depend on a variety of factors, including desired effects, convenience, health considerations, and social contexts. From the classic and timeless joints to sleek and modern THC vapes, to potent dabs, to mouthwatering delicious edibles, each choice comes with its\n25/09/2024 \nCan cannabis be a natural medicinal remedy? \nTo many, cannabis has always been a special player in the category of natural remedies and medicine. Containing over 100 different cannabinoids, with cannabidiol (CBD) and delta-9-tetrahydrocannabinol (THC) being the most well-known and documented, cannabis is exponentially gaining traction for its potential to alleviate various medical conditions. For the everyday person, pain management stands out as one of the most\n25/09/2024",
  "url": "https://neverlandweedshop.com/how-to-spot-fake-muha-meds/"
},
{
  "text": "Cannabis Vape 101: What is THC vaping, Disposable & Carts?\nCannabis vaping is simple: inhale vaporized cannabis oil. It’s catching on because it’s cleaner and safer than smoking. Whether you’re using a disposable vape or a fancy gadget, you’re getting a cleaner and purer THC experience.",
  "url": "https://neverlandweedshop.com/cannabis-vape-101/"
},
{
  "text": "Credits & Rewards | Neverland.OG\nWays to earn rewards \nPoint For Purchase\n8 credits for each 100฿ spent\n8 points for 100 spend\n100฿ Credits for New Members\nRegister now, and get instant 100฿ credits as a welcome gift from Neverland's Family. Lead the Leaderboard! Every click, every share, every referral powers you up the ranks. Hit the summit at Neverland Weed Shop and reap monthly rewards. It's your time to shine!… Show moreShow less\nGet 50 point just give us reveiew!\nEarn 20 point per 1 reveiew, Just tell us abt how you feel? We loved to hear your feedback! Many Thanks from NEVERLAND.OG Team… Show moreShow less\nEarn 150 credits from Referal Rewards\nYou get credits : 150 \nYour friend gets credits : 150\nBring your gang to Neverland Weed Shop. For every new recruit who 'cashes in', you both earn 150 credits. It's the 'dopest' deal in town. Be the kingpin of referrals.… Show moreShow less\nLevel Up Archievement\nGet 150points when you reach new level!\nShare us on twitter to get 50 credits\nShare us on twitter to get 50 credits\nrewards opportunities\nSNOW Buds - Diamond Infused 500-. Credits\nSNOW BUD - THCA Diamond infused Just 500 Credits\nSTIIIZY 40 Mini Blunts Infused THC42% >1,700 Credits\nRedeem STIIIZY 40 Mini Blunts Infused THC42% just 1,700 credits\n10%Discounts for 200 Points\n10%Discounts for 200 Credits\nPoint Conversion\n10฿ discount for 10 points",
  "url": "https://neverlandweedshop.com/loyalty-reward-page/"
},
{
  "text": "Uncategorized @th\nเทคโนโลยี THC Vape: อนาคตของการบริโภคกัญชา\nUncategorized @th\nการที่เทคโนโลยีและการบริโภคกัญชามาบรรจบกันทำให้เกิดการปฏิวัติในการที่แต่ละบุคคลได้รับสาร THC (tetrahydrocannabinol) ซึ่งเป็นสารออกฤทธิ์ทางจิตในกัญชา ท่ามกลางนวัตกรรมมากมาย THC vaping กลายเป็นคู่แข่งแถวหน้า โดยผสมผสานระหว่างดุลยพินิจ ความแรง และความบริสุทธิ์ที่ไม่มีใครเทียบได้ด้วยวิธีการแบบดั้งเดิม บทความนี้เจาะลึกถึงความก้าวหน้าทางเทคโนโลยีที่กำลังกำหนดอนาคตของ THC vape โดยเน้นว่านวัตกรรมเหล่านี้ไม่เพียงแต่เปลี่ยนประสบการณ์ผู้ใช้เท่านั้น แต่ยังจัดการกับความกังวลเกี่ยวกับความปลอดภัย ประสิทธิภาพ และความเป็นส่วนตัวอีกด้วย วิวัฒนาการของอุปกรณ์สูบไอ THC",
  "url": "https://neverlandweedshop.com/category/uncategorized-th/"
},
{
  "text": "NEVERLAND.OG's Blogs Post\nTop 5 พอตกัญชาที่ดีที่สุดในปี 2024: แบรนด์ไหนฮอท? เพราะอะไร?\nมาดูกันว่าพอตกัญชา แบรนด์ไหนได้อันดับดีที่สุดในปี 2024 จัดอันดับและให้คะแนน โดยการรวบรวมข้อมูลจากผู้ใช้พอตกัญชาจริงกว่าร้อยคน\nBEST THC Vape Brands 2024: What’s Hot in Thailand & Why?\nDiscover the top contenders for the best THC vape brand of 2024. Dive into our expert analysis on market leaders and emerging trends in high-quality cannabis vaping.\nSNOW Ball: Diamond Infused Flowers – Where Potency Meets Luxury\nWhat is Snow Ball: Diamond infused Cannabis Flowers? THC Diamonds are just as eye-catching and are crafted from cannabis. These diamonds\nWHAT ARE LIVE-RESIN, ROSIN & DISTILLATES? FOR THC VAPE IN THAILAND\nDistillate, Live Resin, and Live Rosin. Each of these offers a unique experience, catering to different preferences and desired effects.\nReal VS Fake? How to Spot Fake Muha Meds Disposable 2g. ?\nIn the expanding world of cannabis products, the distinction between real and fake items is crucial. Muha Meds, known for its high-quality cannabis offerings including THC Vapes and Muha Meds Mambas – Gummies, is not immune to the problem of imitation. For consumers in Thailand, it’s essential on how to spot Authenthic Muha Meds disposables to ensure safety and get the best experience.\nPick your weapon: joints, bongs or edibles\nChoosing how to consume your cannabis is an important decision that you will inevitably need to make. Your favourite method\nCan cannabis be a natural medicinal remedy?\nTo many, cannabis has always been a special player in the category of natural remedies and medicine. Containing over 100\nDoes cannabis actually help you sleep better?\nPeople have been using cannabis as a sleep aid for some time now, and many users see the benefit of\nCreative things to do while high \nThe legalization of recreational cannabis in Thailand has only made the plant more socially accepted and mainstream. People are discovering\nWhat Is the Difference Between Melt Live Resin Disposable and Melt Exotics Disposable?\nWhen it comes to choosing the right vape, understanding the effects of different products is crucial. If you’re torn between\nWhat’s Different: Benefits of THC Delta-8, Delta-9, Delta-10, HHC, THC-a and THC-p?\nTable of Contents The THC Family: Unpacking the Unique Benefits of Delta-8, Delta-9, Delta-10, HHC, THC-a and THC-p Hey there,\nSuper Lemon Haze Strain: Effects, Flavor, and Where to Find It at Big Chief\nCannabis enthusiasts and connoisseurs are always on the lookout for strains that offer a perfect blend of flavor, potency, and\nThe Ultimate Guide to Big Chief Disposables: Unveiling the Wonders of Live Resin\nWhy Big Chief Live Resin Disposables Are a Must-Try for Cannabis Enthusiasts? Introduction In the vibrant world of cannabis, few\nProduct Review: Jungle Boys Live-Resin\nExploring the Magic of Jungle Boys Live Resin: A Cannabis Connoisseur’s Delight Introduction In the enchanting world of cannabis, few\nLow and slow: a beginners guide for cannabis consumption\nTrying cannabis for the first time can be an exciting but daunting prospect. Searching online, you are bombarded by a\nChoosing the right cannabis strain for you\nCannabis, with its history of recreational use, has an innumerable list of strains which offer different effects and experiences. Even\nChoosing the perfect places for using cannabis\nThere are a variety of factors which will impact your experience with cannabis, but one that is highly underrated is",
  "url": "https://neverlandweedshop.com/blog/"
},
{
  "text": "Neverland Weed Shop: Best Cannabis & THC Vape in Thailand\nDive into our exclusive selection of cannabis products. At Neverland, each item is chosen with care and expertise. Featuring Top brands like Muha Meds, STIIIZY, Sauce Bar, Polkadot and MELT at our store in Bangkok & Website.\nAt Neverland, you’re more than just a customer; you’re part of our community. Our knowledgeable staff are here not just to serve, but to guide you through your cannabis journey, sharing stories of weed strains and their origins to help you find the perfect match for your lifestyle.\nFor those who prefer the comfort of their own home, our online store offers the same wide range of products with the added convenience of delivery. Browse, select, and have your favorite cannabis products delivered directly to your doorstep. Experience the best of Bangkok weed without ever leaving your home.",
  "url": "https://neverlandweedshop.com/"
},
{
  "text": "Terms of Service\nTerms of Service for Neverland Weed Shop\nLast Updated: 22/01/2024\n1. Introduction\nWelcome to Neverland.og site\nThese terms govern your use of neverlandweedshop.com and any related services provided by us.\nBy accessing our website, you agree to these terms in full.\n2. Use of Website\nThis website is intended for users who are at least 20 years old.\nUsers must comply with all local laws regarding online conduct and acceptable content, especially related to cannabis.\n3. Intellectual Property\nAll content published and made available on our site is the property of Neverland.og and the site’s creators.\n4. User Contributions\nUsers may post content as long as it is not offensive, illegal, harmful, or in violation of anyone’s rights.\n5. Sale of Goods and Services\nThis website is designed to offer cannabis flowers, vape pens, and related products.\nWe reserve the right to modify, reject, or cancel your order.\n6. Limitation of Liability\nNeverland Weed Shop and its employees are not liable for any damages that may occur to you as a result of your misuse of our website.\n7. Indemnification\nUsers agree to defend, indemnify, and hold harmless Neverland Weed Shop from any claims, damages, or demands.\n8. Privacy Policy\nRefer to our Privacy Policy for information on how we collect and use your data.\n9. Governing Law\nThese terms are governed by the laws of Thailand.\n10. Changes to These Terms\nWe reserve the right to modify these terms at any time.\n11. Contact Information\nFor any questions or concerns, please email us at admin@neverlandweedshop.com",
  "url": "https://neverlandweedshop.com/term-of-service/"
},
{
  "text": "THC Vape Pens, Disposable & Carts in Thailand\nTHC Vapes\nBangkok’s Top THC Vape Collections\nThe Essence of Premium THC Vaping with at Neverland.og\nDive into the world of THC vape like never before with Neverland. With every puff, dive into the vibrant life of Bangkok. Our exclusive THC range, featuring disposables, cartridges and pods from USA’s elite brands like Muha Meds, Melt & STIIIZY, promises an extraordinary experience. Excellence isn’t just a goal for us, it’s our way of life.\nNeverland specializes in top-quality THC Vape products. If you’re wondering where to buy disposable vape in Bangkok, You come to the right place! Learn more about cannabis vaping\nThe Art of THC Vaping: Disposables, Cartridges, and Pods\nIn the ever-evolving world of THC vaping, variety is the spice of life. Neverland’s collection is a testament to this diversity, offering something for every taste and preference. Let’s delve into the heart of our selection:\nDisposable Vapes: The ultimate convenience and portability, our disposable vapes are ready to use right out of the box, perfect for the adventurer and the minimalist alike. Designed for a single use, they offer a hassle-free way to enjoy your favorite strains without need of maintenance.\nTHC Cartridges: For those who cherish customization and potency, our THC cartridges are your canvas. Compatible with 510 vape pen battery. These cartridges allow you to switch between strains and strengths with ease, offering a tailored vaping experience that’s as unique as you are.\nPod Systems: The future of vaping is here with STIIIZY pod systems. Combining the best of both worlds, pods offer the convenience of disposables with the customization of cartridges.\nExplore Top USA Brands:\nMuha Meds: Revel in the essence of cannabis with Muha Meds’ top-tier cartridges, a blend of potency and unparalleled flavor.\nSTIIIZY: Step into the future with STIIIZY’s sleek pod systems, offering a seamless blend of style and substance.\nMelt: Embrace the simplicity of Melt’s disposable vapes, where convenience meets quality.\nSauce Bar: Experience the symphony of flavors with Sauce Bar, a celebration of terpenes in each disposable vape.\nBig Chief: Discover the robust flavors and potent draws of Big Chief’s cartridges, where heritage meets modern extraction.\nDesigned for Every Cannabis Explorer & Enthusiast\nWhether you’re navigating the bustling streets of Bangkok or seeking solace in its hidden sanctuaries. Neverland’s THC vaping selection is your companion on this journey. From the discreet elegance of disposables to the refined customization of cartridges and pods, Neverland caters to every moment, mood, and memory.\nYour Ultimate Vaping Destination Awaits at Neverland\nNeverland isn’t just a destination, it’s a journey. A journey that promises discovery, satisfaction, and a deeper connection to the world of cannabis. Every product you select is of the highest quality, and every experience you have is unforgettable.\nStep into Neverland Weed Shop, where the world of THC vaping unfolds in all its glory. Explore our curated selection of disposables, cartridges and pods. Embark on a vaping adventure like no other. In Bangkok’s ever-expanding cannabis landscape, Neverland stands out as a haven for those who seek the best.\nAs the only authorized Distributor of MELT Brands in Thailand, we bring you only high-quality and 100% authentic products.\nRaw Garden 510 Battery\nOriginal price was: 1,890฿.Current price is: 1,550฿. Add to cartPurchase & Earn 124 credits! \nThe Raw Garden 510 Battery is a high-quality, variable voltage vape battery designed for use with 510 threaded cartridges.\nFeaturing a 350 mAh capacity and USB rechargeable design, this battery offers customizable vaping experiences with three temperature settings for optimal flavor.\nTRE HOUSE | Live Resin HHC Vape Pen\nOriginal price was: 2,590฿.Current price is: 2,290฿. Select optionsEarn up to 183 credits. This product has multiple variants. The options may be chosen on the product page \nTRE HOUSE’s Live Resin HHC Vape Pen offers 2g of highly potent HHC for a truly unforgettable experience\nwith a rechargeable and disposable design for maximum convenience.\nTRE HOUSE | THC-A Live Resin Liquid Budder Vape Pen\nOriginal price was: 2,890฿.Current price is: 2,450฿. Select optionsEarn up to 196 credits. This product has multiple variants. The options may be chosen on the product page \nUnlock the Power of THC-A with TRE HOUSE Discover the ultimate vaping experience with TRE HOUSE’s THC-A Live Resin Liquid Budder Vape Pen\nCold Fire Cartridge\nOriginal price was: 3,590฿.Current price is: 3,090฿. Select optionsEarn up to 247 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the pinnacle of vaping with Clod Fire Cartridge.\nThese premium carts deliver unmatched flavor and potency, crafted from top-shelf cannabis strains.\nPerfect for connoisseurs seeking a pure, additive-free experience.\nFlavorade Cartridge\nOriginal price was: 3,490฿.Current price is: 3,050฿. Select optionsEarn up to 244 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the ultimate in cannabis vaping with Flavorade Cartridges.\nThese premium carts deliver a potent and flavorful hit every time, ensuring a smooth and enjoyable experience.\nTRE HOUSE Magic Mushroom Vape 2g\nOriginal price was: 3,890฿.Current price is: 3,500฿. Select optionsEarn up to 280 credits. This product has multiple variants. The options may be chosen on the product page \nGet ready to soar with TRE HOUSE Magic Mushrooms Vape!\nThis super convenient vape bursts into action right out of the box with 2g of our finest magic mushroom blend.\nExpect around 800 vibrant puffs of delicious pink lemonade flavor, perfect for anyone in Thailand looking to spice up their routine with some psychedelic fun. Just unpack, puff, and let the magic take over!\nRaw Garden Cartridge\nOriginal price was: 2,890฿.Current price is: 2,450฿. Select optionsEarn up to 196 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the best in cannabis vaping with Raw Garden Refined Live Resin Cartridges. Order now and elevate your vaping experience to new heights.\nAvailable Flavors..\nCreme OG\nBlueberry Cookies\n818 OG\nFrosted Sin\nSweet Fire OG\nPurple Unicorn\nMelt THCA Diamonds Live-Resin Disposable 2g\nOriginal price was: 2,600฿.Current price is: 2,490฿. Select optionsEarn up to 199 credits. This product has multiple variants. The options may be chosen on the product page \nThe Melt THCA Diamonds Live-Resin Disposable 2g offers a premium vaping experience, combining the potency of THCA diamonds with the rich, full-spectrum benefits of live resin!\nMELT AMF Exotic Liquid Diamonds 2g\n2,490฿ Select optionsEarn up to 199 credits. This product has multiple variants. The options may be chosen on the product page \nExperience a symphony of taste with MELT Exotic Liquid Diamonds disposables. Each carefully crafted strain offers a unique, mouthwatering flavor profile that tantalizes the senses. Elevate your vaping experience with premium, terpene-packed cannabis extracts that prioritize exceptional taste and aroma.\nAvailable Flavor..\nBlueberry Tart – Hybrid\nDewlato – Indica\nLemon Blast – Sativa\nPink Bubblegum – Hybrid\nWatermelon Lush – Hybrid\nMuha Meds Disposable 2G – Delivery in Thailand by Neverland\nOriginal price was: 3,100฿.Current price is: 2,650฿. Select optionsEarn up to 212 credits. This product has multiple variants. The options may be chosen on the product page \nExperience The Muha Meds Disposable 2g Authentic before anyone else in Thailand. This is a Top leading brand from the USA. So, This all-in-one vape pen is the ultimate solution for cannabis enthusiasts and travelers alike. So you can enjoy premium quality strains on the go.\nWEEDY WEED POD – Disposable THC Vape Pod\nOriginal price was: 1,890฿.Current price is: 1,490฿. Select optionsEarn up to 119 credits. This product has multiple variants. The options may be chosen on the product page \nDiscover the ultimate vaping convenience with the Weedy Vape and our exclusive Weedy Weed Pod.\nThis compact, disposable device is pre-filled with a top-notch THC vape oil, boasting 10 exquisite fruity cannabis strains to choose from.\nIt’s USB-powered for consistent performance and designed for on-the-go ease. Elevate your vaping experience with Weedy Vape, where fruity flavors meet cannabis bliss in every puff!",
  "url": "https://neverlandweedshop.com/cannabis/thc-vape/"
},
{
  "text": "About Us - Neverland.OG\nWelcome to Neverland Weed Shop, a sanctuary for cannabis enthusiasts in the vibrant city of Bangkok. Our journey began with a simple dream – to create a haven where quality meets passion, and where every experience is tailored to your unique lifestyle.\nAt Neverland Weed Shop, we believe in offering only the best. That’s why we proudly feature products from the most renowned cannabis brands in the industry, ensuring an unmatched level of quality and consistency with every purchase.\nWhether you’re a seasoned cannabis connoisseur or a curious newcomer, Neverland Weed Shop is your gateway to a world of possibilities. Discover the art of cannabis, explore new experiences, and embark on a journey like no other.",
  "url": "https://neverlandweedshop.com/about/"
},
{
  "text": "Contact Us - Neverland Weed Shop Bangkok\nGet in Touch with Us\nWelcome to Neverland Weed Shop!\nYour go-to spot for premium cannabis that soothes and excites. Have questions or just want to chat about our products? We’re all ears and ready to help!\nDrop by:\n2nd floor Neverland Weed Shop Box Space Ratchayothin 15-15/1 Ratchadaphisek Rd, Chatuchak, Bangkok 10900\nRing us:\n+66 88 969 1555, +66 85 501 1270\nShoot us an email:\ncontact@neverlandweedshop.com\nQuick Contact Form:\nGot something to say? We’re here to listen. Fill out the form, and we’ll get back to you in no time!\nSee Where We Are:\nStay Connected:\nLine: @neverland.og\nWhatsapp: +66 88 969 1555, +66 85 501 1270\nWe’re excited to hear from you—reach out today and let’s talk all things cannabis!",
  "url": "https://neverlandweedshop.com/contact/"
},
{
  "text": "Find the Best Weed Shop in Thailand: Weed Map\nWelcome to your comprehensive resource for navigating the weed shop in Thailand! Our interactive weed map serves as an a tool for locating all cannabis dispensary and weed shops throughout the nation. Whether you’re a resident or a visitor keen on explore Thailand’s cannabis dispensary, this map is tailored just for you. Our platform simplifies the search for reputable cannabis shops, offering detailed information to help you make informed choices. From bustling weed shops in Bangkok to specialized cannabis dispensaries in more secluded areas, our map provides a well-rounded view of what Thailand has to offer in terms of cannabis. So go ahead, enrich your knowledge and explore the diverse range of cannabis shops in Thailand!\nWelcome to our guide on Top 5 cannabis strains you can find in Thailand! If you’re using our weed map or visiting local cannabis shops, you’ll see there are thousands of options. But which ones are the best? That’s what this guide is for! We’ve picked the top 5 strains that people in Thailand love the most. Whether you’re new to cannabis or have been using it for a while, this list has something for you. So, let’s get started and learn about the best strains you can try in Thailand!",
  "url": "https://neverlandweedshop.com/weed-map-thailand/"
},
{
  "text": "Cannabis Flowers, Exotic & Top shelf Strain\nCannabis Flower: An Expert’s Selection\nWelcome to Neverland, where our cannabis buds are more than just products—they are a culmination of over a decade of expertise and passion for the cannabis craft. Here, we understand that selecting the right bud is both an art and a science.\nBuy Cannabis in Thailand\nFor those looking to buy cannabis in Thailand, Neverland offers a sanctuary of strains. Our expertise extends beyond the sale; we educate and guide you through the nuances of each variety. Our commitment is to your satisfaction, providing a seamless journey from our carefully curated catalog to your door.\nBuy Weed Bangkok\nBangkok’s vibrant spirit is matched by our dynamic range of cannabis. When you buy weed in Bangkok from Neverland, you’re not just making a purchase; you’re investing in a quality experience.\nOriginal Thai Weed\nOur Thai weed is a nod to the country’s rich cannabis heritage, offering flavors and effects that are as complex as they are captivating. We celebrate the legacy of Thai cannabis cultivation by providing access to strains that are both traditional and innovative.\nExperience the perfect blend of sweet and sour with Lemon Cherry Gelato, a potent hybrid strain that offers a delightful mix of relaxation and euphoria.\nKnown for its mouthwatering flavor profile and balanced effects, this strain is a favorite among both novice and experienced cannabis enthusiasts.\nStart your day right with the Breakfast of Champions strain, a perfectly balanced hybrid that offers an uplifting and relaxing experience.\nThis rare 50/50 indica-sativa blend combines the best of Fruity Pebbles and Animal Mints, delivering a sweet, fruity flavor with hints of mint and pine.\nStrawberry Jello Runtz Strain | Hybrid Indica\nIndulge in the sweet and fruity delight of the Strawberry Jello Runtz Strain, a hybrid cannabis flower that combines the best of Strawberry Jello and Runtz.\nKnown for its mouthwatering aroma and balanced effects, this strain offers a unique and enjoyable experience.\nObama Runtz Strain | Hybrid Indica\nExperience the presidential power of the Obama Runtz Strain, a potent indica-dominant hybrid that combines the best of Runtz and Obama Kush.\nKnown for its sweet, fruity aroma and relaxing effects, this strain is perfect for unwinding after a long day.\nWatermelon Mimosa Strain | Hybrid Sativa\nExperience the refreshing and potent Watermelon Mimosa Strain, a hybrid Sativa dominant cannabis flower that combines the sweet aroma of watermelon with the energizing effects of Mimosa.\nPerfect for daytime use, this strain offers a balanced blend of relaxation and focus.\nMimosa EVO Strain | Hybrid Indica\nMimosa EVO is a high-potency hybrid strain with a 60% indica and 40% sativa ratio.\nKnown for its uplifting and euphoric effects, this strain boasts THC levels between 24% and 30%.\nEnjoy its zesty tropical citrus flavor with hints of berries, perfect for both recreational and therapeutic use.\nWhite Truffle Strain | Hybrid Indica\nWhite Truffle is an Indica-dominant hybrid known for its potent effects and unique flavor profile this strain offers a calming and euphoric experience, perfect for unwinding after a long day.\nEnjoy its earthy, skunky aroma and rich, savory taste.\nPink Runtz Strain | HYBRID\nPink Runtz is a balanced hybrid strain with 23%-26% THC.\nKnown for its sweet, fruity flavor and uplifting effects, it’s perfect for social occasions and stress relief.\nStrawberry Amnesia Strain | Sativa\nOriginal price was: 690฿.Current price is: 450฿. Add to cartPurchase & Earn 36 credits! \nStrawberry Amnesia is a sativa-dominant hybrid with 22-25% THC.\nRenowned for its sweet strawberry flavor and uplifting effects, it’s ideal for daytime use and stress relief.\nSNOW BUD: Diamond Infused Cannabis Buds(USA)\nOriginal price was: 990฿.Current price is: 660฿. Select optionsEarn up to 53 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the exceptional with SNOW BUD – Diamond Infused.\nA masterpiece from the Snow Bud, this hybrid marvel blends Zkittlez and Gelato into an aromatic symphony of sweet, candy-like notes.\nWith an impressive THC content of 48.5%, Crafted with a unique diamond infusion process, it elevates your senses with a perfect balance of uplifting joy and serene relaxation. Dive into a world where quality meets luxury in every puff.\n710 Labs Flowers | Garlic Cocktail #7 | 3.5g\nOriginal price was: 2,990฿.Current price is: 2,590฿. Add to cartPurchase & Earn 207 credits! \nExperience the robust effects of 710 Labs Flowers with Garlic Cocktail #7, an indica-dominant hybrid known for its strong garlic aroma.\nIdeal for stress relief and promoting sleep, this strain offers a balanced and relaxing high.\nPerfect for unwinding after a long day. ??\nMochi Strain | HYBRID\nOriginal price was: 690฿.Current price is: 500฿. Add to cartPurchase & Earn 40 credits! \nSavor the sweet and creamy Mochi Strain, a balanced hybrid with a delightful flavor profile.\nEnjoy its relaxing yet energizing effects, perfect for staying calm and focused.\nIdeal for those seeking a harmonious cannabis experience without overwhelming drowsiness. ??",
  "url": "https://neverlandweedshop.com/cannabis/cannabis-flower/"
},
{
  "text": "Cannabis Concentrates | Dabs, Live-Resin, Live-Rosin, Hash Rosin\nThe Secret World of Cannabis Concentrates\nStep into the shadows of the cannabis world and discover the magic of concentrates. They’re not just strong; they’re a hidden world of wonder.\nDabs and Wax: Imagine a tiny drop that holds the biggest secrets of cannabis. Dabs and wax are like that. They’re powerful and full of surprises in a small package.\nLive-Resin: Think of the freshest plant, frozen in time, keeping all its flavors. That’s live-resin. It’s like tasting the plant’s hidden song.\nDiamonds: In the quiet corners, you find diamonds. They’re not just shiny; they’re pure and strong. They’re the treasure of the concentrate world.\nLive-Rosin: Press a flower, and out comes rosin. It’s simple, clean, and true. It’s the whisper of the plant, turned into something you can touch.\nIn this world, every concentrates tells a secret story. It’s a place for those who love to explore and find new wonders here.. at Neverland.og Weed Shop, Thailand\n420฿ – 1,750฿ Select optionsEarn up to 140 credits. This product has multiple variants. The options may be chosen on the product page \nExperience premium cannabis with Baby Jeeter Pre-rolled infused joints.\nEach jar contains 5 perfectly crafted 0.5g joints, infused with liquid diamonds and dusted with kief for an unparalleled smoking experience.\nSTIIIZY Live Rosin Badder : Dabs Perfection\nOriginal price was: 2,890฿.Current price is: 2,550฿. Select optionsEarn up to 204 credits. This product has multiple variants. The options may be chosen on the product page \nDiscover the purest cannabis experience with STIIIZY Rosin Badder.\nSolventless extraction ensures maximum purity and potency.\nShop now at Neverland Weed Shop.\n710 LABS Live Rosin Badder 1g: Dabbing Perfection\nOriginal price was: 4,500฿.Current price is: 4,190฿. Select optionsEarn up to 335 credits. This product has multiple variants. The options may be chosen on the product page \nStep into the world of premium concentrates with 710 LABS Live Rosin Badder. A perfect blend of innovation, quality, and authenticity.\nSNOW BUD: Diamond Infused Cannabis Buds(USA)\nOriginal price was: 990฿.Current price is: 660฿. Select optionsEarn up to 53 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the exceptional with SNOW BUD – Diamond Infused.\nA masterpiece from the Snow Bud, this hybrid marvel blends Zkittlez and Gelato into an aromatic symphony of sweet, candy-like notes.\nWith an impressive THC content of 48.5%, Crafted with a unique diamond infusion process, it elevates your senses with a perfect balance of uplifting joy and serene relaxation. Dive into a world where quality meets luxury in every puff.\nMuha Meds – Hash Rosin(Dab) | Neverland.OG\nOriginal price was: 2,450฿.Current price is: 2,390฿. Select optionsEarn up to 191 credits. This product has multiple variants. The options may be chosen on the product page \nDiscover the unparalleled purity and potency with Muha Meds Hash Rosin, a premium concentrate for connoisseurs seeking the ultimate dabbing experience. Extracted using traditional methods to preserve the full spectrum of terpenes and cannabinoids, Muha Meds Hash Rosin represents the pinnacle of purity and potency in the cannabis market.\nSTIIIZY 40’s Mini Blunts Premium Pre-rolled Infused\n420฿ – 1,800฿ Select optionsEarn up to 144 credits. This product has multiple variants. The options may be chosen on the product page \nSTIIIZY 40’s Mini Blunts 0.5g Pre-rolled Infused – the ultimate choice for cannabis connoisseurs seeking convenience without compromising on quality.\nEach mini blunt is expertly crafted to deliver a potent and memorable experience.\nSize: 0.5g pre-rolled, ideal for individual enjoyment or sharing.\nInfusion: Enhanced with premium concentrates for maximum effect and flavor.\nConvenience: Ready-to-use, perfect for on-the-go enjoyment or effortless relaxation.\n8 Strains Available\nStrawberry Coungh | Sativa\nPurple Punch | Indica\nStrawnana | Hybrid\nGelato | Hybrid\nBlue Dream | Sativa\nBiscotti | Indica\nPink Akai | Hybrid\nPineapple Express | Hybrid Sativa\nIdeal for on-the-go or relaxing moments, elevate your enjoyment with STIIIZY.\nSTIIIZY Curated Live Resin 1g (Dab/Wax)\nOriginal price was: 2,490฿.Current price is: 1,890฿. Select optionsEarn up to 151 credits. This product has multiple variants. The options may be chosen on the product page \nExperience the pinnacle of cannabis concentrates with STIIIZY Curated Live Resin.\nHarvested at peak freshness and flash-frozen to preserve the unique terpene profile of each strain, this premium live resin offers unmatched potency, flavor, and consistency.\nPerfect for dabbing enthusiasts seeking a pure and powerful experience.",
  "url": "https://neverlandweedshop.com/cannabis/concentrates/"
},
{
  "text": "Experience The Best Edibles in Thailand\nWelcome to Neverland: Your Elite Source for THC Edibles in Thailand\nNeverland’s Edibles: A Gourmet Cannabis Experience\nCannabis Edibles Thailand: Dive into a world where premium cannabis meets culinary art.\nNeverland is more than a place; it’s an experience, offering a sophisticated menu of THC edibles.\nTHC Gummies and More: From the subtle elegance of THC gummies to a variety of other cannabis-infused delights, our menu caters to every taste.\nUnraveling the World of Cannabis Edibles\nAt the heart of our edibles lies a fusion of THC and CBD, the dynamic components of the cannabis plant.\nEdibles offer a distinct experience from smoking: a gradual, more profound journey of taste and sensation.\nOur selection marries beloved flavors with the subtle, rich notes of cannabis, offering a diverse range from sweet indulgences to savory treats.\nWhy Choose Neverland for Weed Edibles?\nTop-Quality Brands: We feature the best from the USA, including Muha Meds Mambas, STIIIZY Edibles, and WYLD Gummies.\nEdibles Bangkok: Located in the heart of Bangkok, we’re at the forefront of the THC edibles scene.\nBenefits of Neverland’s THC Edibles\nLong-Lasting Effects: Our edibles offer an extended, immersive experience.\nDiscreet and Convenient: Ideal for those who prefer a private way to enjoy cannabis.\nVariety of Flavors: Catering to all preferences, from CBD gummies to gourmet brownies.\nPrecise Dosing: Ensuring a consistent experience for every user.\nSmoke-Free Option: A sophisticated, lung-friendly way to enjoy cannabis.\nJoin Us at Neverland – Online Cannabis Shop\nOrder THC Edibles Online: Easy and convenient, get your favorite edibles delivered.\nWe didn’t have just a THC Cannabis infused Edibles, but we also have CBD Edibles and Magic Mushrooms infused Edibles too! Yes Magic Mushroom!\nLet’s find your Neverland with us\nVisit Our Bangkok Dispensary: For a personalized experience, come see us in-store.\nEmbark on a journey with Neverland Weed Shop. Whether you’re new or experienced, our Bangkok dispensary is your gateway to exploring the finest in cannabis cuisine.\nPolaroid Magic Mushrooms Gummies\nOriginal price was: 1,990฿.Current price is: 1,750฿. Select optionsEarn up to 140 credits. This product has multiple variants. The options may be chosen on the product page \nPolaroid Magic Mushrooms Gummies offer a fun and flavorful way to experience the benefits of psilocybin.\nEach pack contains 5g of premium psilocybin mushrooms and is available in five delicious flavors.\nPerfect for both new and experienced users seeking a convenient and enjoyable psychedelic experience.\nStoner Patch THC Gummies 500mg\nOriginal price was: 850฿.Current price is: 750฿. Select optionsEarn up to 60 credits. This product has multiple variants. The options may be chosen on the product page \nIndulge in the delightful fusion of nostalgic candy flavors and potent THC with Stoner Patch THC Gummies 500mg.\nAvailable in a variety of mouthwatering flavors including Original, Strawberry, Grape, Watermelon, and Tropical, these gummies offer a discreet and enjoyable way to experience the benefits of cannabis.\nJolly Rancher THC Gummies 600mg\nOriginal price was: 950฿.Current price is: 850฿. Add to cartPurchase & Earn 68 credits! \nIndulge in a nostalgic twist on a classic candy with Jolly Rancher THC Gummies 600mg.\nThese delectable gummies combine the mouthwatering flavors of Jolly Ranchers with the potent effects of THC, offering a delightful and powerful cannabis experience.\nWYLD Premium THC Gummies\nOriginal price was: 1,990฿.Current price is: 1,790฿. Select optionsEarn up to 143 credits. This product has multiple variants. The options may be chosen on the product page \nElevate your cannabis experience with WYLD Premium THC Gummies, crafted with real fruit and enhanced with carefully selected cannabis terpenes.\nAvailable in a variety of tantalizing flavors, each offering unique tastes and effects.\nDiscover the perfect gummy for your needs, whether it’s relaxation, sleep support, focus, or a balanced high.\nShop now for wyld gummies, wyld thc gummies, and wyld edibles in Bangkok at Neverland Weed Shop\nLocal Boys | THC Craft Soda\nOriginal price was: 159฿.Current price is: 129฿. Select optionsEarn up to 10 credits. This product has multiple variants. The options may be chosen on the product page \nDiscover Local Boys THC Craft Soda – a premium cannabis-infused beverage available in Mellow Berry and Grapefruit OG flavors.\nEnjoy a refreshing, hangover-free alternative to alcohol with 1.6mg THC per 330ml bottle.\nExperience the perfect blend of flavor and relaxation.\nLocal Boys | Kratom Craft Soda\nOriginal price was: 189฿.Current price is: 159฿. Select optionsEarn up to 13 credits. This product has multiple variants. The options may be chosen on the product page \nDope Lemon:\nBoost your energy and mood with Local Boys Kratom Craft Soda in Dope Lemon flavor.\nInfused with high-quality kratom, this lemon and honey soda is perfect for athletes and active individuals seeking a natural pick-me-up.\nSundaze Cola:\nEnjoy the classic flavors of root beer and vanilla with Local Boys Kratom Craft Soda in Sundaze Cola flavor.\nThis kratom-infused soda provides a unique blend of energy and relaxation, ideal for professionals and creatives.\nDiip CBD Gummies 125mg\nOriginal price was: 390฿.Current price is: 290฿. Select optionsEarn up to 23 credits. This product has multiple variants. The options may be chosen on the product page \nDiip CBD Gummies 125mg\nCBD Morning Gummies 125 mg | Lychee flavor\nCBD Night Gummies 125 mg | Grape flavor\nCBD Immunity Gummies 125 mg | Apple flavor\nWarning: The Product Names “Sleep”, “Morning”, “Immunity” and “Daily” are not an indication or claim to any function or intention to affect the structure of the body.\nThese statements have not been evaluated by the Food & Drug Administration.\nThis product is not intended to diagnose, treat, cure or prevent any disease. Individual results will vary.\nPolkadot Magic Mushroom Chocolate | 4g of Mushroom per box!\nPolkadot Magic Mushrooms Chocolate\nPackage Contents: Each box contains 4 grams of high-quality magic mushrooms.\nExquisite Flavor Selection:\nGood Luck Charms: A whimsical blend of marshmallow and cereal bits for a nostalgic treat.\nButterlicious: Creamy, rich butter-infused chocolate for a smooth and luxurious taste.\nCinnamon French Toast: Spiced with cinnamon and a hint of sweetness, mimicking the beloved breakfast dish.\nCookies n’ Cream: Classic and beloved, with crunchy cookie bits swirled in creamy white chocolate.\nHorchata: Inspired by the traditional drink, with notes of cinnamon and vanilla in a comforting chocolate form.\nDark Intense: For the purists, a deep, rich dark chocolate that satisfies the need for intensity.\nKrispy Chocolate Crunch: A playful crunch meets smooth chocolate for a texturally dynamic bite.\nS’More: A campfire favorite reimagined in chocolate, with hints of marshmallow and graham cracker.\nPremium Quality Ingredients: Expertly dosed with psilocybin and crafted with the finest chocolates for a consistently delightful experience.\nOriginal price was: 1,690฿.Current price is: 1,350฿. Add to cartPurchase & Earn 108 credits! \n20mg full-spectrum CBD per serving\nTastes like a combination of fresh peaches & pears\nCan get you super baked\nVegan & gluten-free\n1 gummy per serving\n20 or 40 gummies per bottle\nWarning: May cause psychotropic effect",
  "url": "https://neverlandweedshop.com/cannabis/edibles/"
},
{
  "text": "Return & Refund | Neverland.OG\nAt Neverland Weed Shop, we are committed to providing our customers with high-quality cannabis products and exceptional service. We understand that there may be instances where you need to return a product or request a refund. This policy outlines the terms and conditions for such requests.\nAll rights of condition change are reserved without notice.\nProduct Exchange Policy\nIn case of wrong shipping, damaged products caused by the manufacturer; product exchange can be requested within 3 days after receiving. Contact us at Line:@neverland.bkk along with your order number.\nEligibility for Return\nYou may be eligible for a retund if you meet one or more of the following criteria:\nYou received a damaged or defective product.\nYou received the wrong product.\nReturn Policy\nDiscounted products are not returnable unless stated otherwise\nItems must be in original condition; undamaged and original packaging\nReturn Steps\nContact us at Line @neverland.og along with your order number.\nOur staff will give you the return process instructions.\nRefund Conditions\nWhen your order is returned by the system\nRefund is made according to the payment method. \nRefund will begins after items are returned to us and product quality is approved.",
  "url": "https://neverlandweedshop.com/refund_returns/"
}]